gdgly/NUC97X_JS/STM32F4xx/CSG/MenuCSG/Menu_7_ParametersSetting.c
/*************************************************
版权:正泰仪表智能终端部
文件:Menu_7_ParametersSetting.c
作者:zyl
版本:1.00
日期:20170717
描述:南网负控菜单7参数设置与查询处理文件
*************************************************/


//菜单7 参数设置与查询
#include "../Hcsg/ProjectCSG.h"
#include "../QCSG_Head/QCSG_UpLinkProtocol.h"
#include "../QCSG_Head/QCSG_LocalLinkProtocol.h"
#include "../QCSG_Head/QCSG_DLT645_Protocol.h"
#include "../QCSG_Head/QCSG_PublicDefine.h"
#include "../QCSG_Head/QCSG_PublicFunc.h"
#include "../QCSG_Head/QCSG_Table.h"
#include "../QCSG_Data/QCSG_DefaultData.h"
#include "../QCSG_Data/QCSG_NandDataInterface.h"
#include "../Display/Display.h"
#include "../Display/DisplayLoop.h"
#include "../Display/DisplayLoop_Warning.h"
#include "Menu.h"
#include "Menu7.h"
#include "../Device/MEMRW.h"
#include "../Calculate/Calculate.h"
#include "../STM32F4xx/STM32F4xx_RTC.h"
#include "../Device/RTC.h"
#include <string.h>
#include <stdio.h>


const u8 pMenu_7[]=//负控终端参数设置与查询
{
	"\n\r"
	"通讯通道设置\n\r"
	"测量点参数设置\n\r"
	"限值参数查询\n\r"
};


const u8 JZQpMenu_7[]=//南网集中器参数设置与查询
{
	"\n\r"
	"通讯通道设置\n\r"
	"测量点参数设置\n\r"
	"限值参数查询\n\r"
	"级联参数查询与设置\n\r"
};


const u8 pMenu_7_1[]=
{
	"\n\r"
	"IP及端口号设置\n\r"
	"通信方式设置\n\r"
	"APN设置\n\r"
	"专网用户名设置\n\r"
	"专网密码设置\n\r"
	"终端IP地址\n\r"
#if((Project == 300)&&(USER == 3400))
	"云南通信参数一键设置\n\r"
#endif
};


const u8 pMenu_7_1_1[]=
{
	"\n\r"
	"主用IP及端口号设置\n\r"
	"备用IP及端口号设置\n\r"
};


const u8 pMenu_7_1_1_1[]=
{
	"\n\r"
	"主用端口：\n\r"
	"主用IP类型：\n\r"
	"主IP：\n\r"
	"      确认设置\n\r"
};


const u8 pMenu_7_1_1_2[]=
{
	"\n\r"
	"备用1端口：\n\r"
	"备用1类型：\n\r"
	"备1：\n\r"
	"备用2端口：\n\r"
	"备用2类型：\n\r"
	"备2：\n\r"
	"      确认设置\n\r"
};


const u8 pMenu_7_1_2[]=
{
	"\n\r"
	"连接方式：\n\r"
	"重拨间隔(秒)：\n\r"
	"重拨次数(次)：\n\r"
	"心跳周期(分)：\n\r"
	"      确认设置\n\r"
};


const u8 pMenu_7_1_6[]=
{
	"\n\r"
	"IP  ：\n\r"
	"子网：\n\r"
	"网关：\n\r"
	"      确认设置\n\r"
};




const u8 pMenu_7_1_7[]=
{
	"\n\r"
	"曲靖\n\r"
};


const u8 pMenu_7_1_7_1[]=
{
	"\n\r"
	"普通卡\n\r"
	"物联卡\n\r"
};


const u8 pMenu_7_1_7_1_1[]=
{
	"\n\r"
	"中国移动\n\r"
	"中国联通\n\r"
	"中国电信\n\r"
};


const u8 pMenu_7_1_7_1_1_1[]=
{
	"\n\r"
	"IP:                 \n\r"
	"端口:               \n\r"
	"APN:                \n\r"
	"      确认设置\n\r"
};



const u8 pMenu_7_1_7_1_1_2[]=
{
	"\n\r"
	"IP:                 \n\r"
	"端口:               \n\r"
	"APN:                \n\r"
	"用户名:\n\r"
	"　　　　　　　　　　\n\r"
	"密码:\n\r"
	//"      确认设置\n\r"
};




const u8 pMenu_7_2[]=
{
	"\n\r"	
	"设置测量点\n\r"
	"查询测量点\n\r"
	"修改测量点\n\r"
	"删除测量点\n\r"
};
	

const u8 pMenu_7_2_1[]=
{
	"\n\r"	
	"测量点号    \n\r"
	"有效位      \n\r"
	"通信速率    \n\r"	
	"通信端口       \n\r"
	"协议类型      \n\r"
	"通信地址            \n\r"
	"采集器              \n\r"
	"      确认设置\n\r"
};


//#if (Project == 200) || (Project == 900) //南网集中器
const u8 pJZQMenu_7_2_1[]=
{
	"\n\r"	
	"测量点号    \n\r"
	"有效位      \n\r"
	"通信速率    \n\r"	
	"通信端口       \n\r"
	"协议类型      \n\r"
	"通信地址            \n\r"
	"采集器              \n\r"
	"电表类型        \n\r"
	"总分类型        \n\r"	
	"重点户          \n\r"
	"拉闸功能        \n\r"
	"费率数      \n\r"
	"CT变比      \n\r"
	"PT变比      \n\r"
	"      确认设置\n\r"
};
//#endif


const u8 pMenu_7_2_2[]=
{
	"\n\r"
	"测量点号    \n\r"
	"        确认\n\r"
};


const u8 pMenu_7_2_3[]=
{
	"\n\r"
	"从测量点:\n\r"
	"到测量点:\n\r"
	"        确认\n\r"
};


const u8 pMenu_7_2_4[]=
{
	"\n\r"	
	"测量点号    \n\r"
	"有效位      \n\r"
	"通信速率    \n\r"	
	"通信端口       \n\r"
	"协议类型      \n\r"
	"通信地址            \n\r"
	"采集器              \n\r"
};

//#if Project == 200 //南网集中器
const u8 pJZQMenu_7_2_4[]=
{
	"\n\r"	
	"测量点号    \n\r"
	"有效位      \n\r"
	"通信速率    \n\r"	
	"通信端口       \n\r"
	"协议类型      \n\r"
	"通信地址            \n\r"
	"采集器              \n\r"
	"电表类型        \n\r"
	"总分类型        \n\r"	
	"重点户          \n\r"
	"拉闸功能        \n\r"
	"费率数      \n\r"
	"CT变比      \n\r"
	"PT变比      \n\r"
};
//#endif


const u8 pMenu_7_3[]=
{
	"\n\r"
	"月通信流量越限值\n\r"
	"电能表时钟超差阈值\n\r"
	"电能表飞走阈值\n\r"
};


const u8 pJZQMenu_7_3[]=
{
	"\n\r"
	"月通信流量越限值\n\r"
	"电能表时钟超差阈值\n\r"
	"电能表停走阈值\n\r"
};


const u8 pMenu_7_3_1[]=
{
	"\n\r"
	"越限值(kB)：\n\r"
};


const u8 pMenu_7_3_2[]=
{
	"\n\r"
	"时钟超差(min)：\n\r"
};


const u8 pMenu_7_3_3[]=
{
	"\n\r"
	"飞走阈值(倍)：\n\r"
};


const u8 pJZQMenu_7_3_3[]=
{
	"\n\r"
	"停走阈值(kWh)：\n\r"
};



#if Project == 200 //南网集中器
const u8 pMenu_7_4[]=
{
	"\n\r"
	"级联从终端地址\n\r"
	"主终端地址\n\r"
	"被抄终端地址\n\r"
};


const u8 pMenu_7_4_1[]=
{
	"\n\r"
	"级联从终端地址1\n\r"
	"级联从终端地址2\n\r"
	"级联从终端地址3\n\r"
	"级联从终端地址4\n\r"
};


const u8 pMenu_7_4_1_1[]=
{
	"\n\r"
	"终端地市区县码\n\r"
	"终端地址\n\r"
};


const u8 pMenu_7_4_1_1_1[]=
{
	"\n\r"
	"设置值：\n\r"
	"      确认设置\n\r"
};


const u8 pMenu_7_4_1_1_2[]=
{
	"\n\r"
	"终端地址：\n\r"
	"      确认设置\n\r"
};
#endif





//-------------------------------------------------------------------------------------------------
// Function name:       Menu_7_1
// Descriptions:        通讯通道设置
// input parameters:    无
// output parameters:   无
// Returned value:      无
//-------------------------------------------------------------------------------------------------
void Menu_7_1(void)//负控终端通讯通道设置
{
	switch(Stack->MenuStack[MenuCount->Count].Task)//菜单任务计数
	{
		case 0://任务0:初始化
			Stack->MenuStack[MenuCount->Count].Task=1;
			DisplayMenu(Stack->MenuStack[MenuCount->Count].MoveRow,(u8 *)pMenu_7_1);//显示菜单
			Arrowhead();
			MenuNegative(Stack->MenuStack[MenuCount->Count].EditRow);//反显菜单行
			break;
		case 1://任务1:选择
			MenuSelect();//菜单选择
			if((Comm_Ram->ButtonVal&0x10)!=0)
			{//确认
				switch(Stack->MenuStack[MenuCount->Count].EditRow+Stack->MenuStack[MenuCount->Count].MoveRow)
				{
					case 1:
						MenuCreate((u32)Menu_7_1_1);//IP及端口号设置
						break;
					case 2:
						MenuCreate((u32)Menu_7_1_2);//通信方式设置
						break;
					case 3:
						MenuCreate((u32)Menu_7_1_3);//APN设置 
						break;
					case 4:
						MenuCreate((u32)Menu_7_1_4);//专网用户名设置
						break;
					case 5:
						MenuCreate((u32)Menu_7_1_5);//专网密码设置
						break;
					case 6:
						MenuCreate((u32)Menu_7_1_6);//终端IP地址
						break;
					#if((Project == 300)&&(USER == 3400))
						case 7:
							MenuCreate((u32)Menu_7_1_7);//云南通信参数一键设置
							break;
					#endif
					default:
						break;
				}              
			}
			if((Comm_Ram->ButtonVal&0x20)!=0)
			{//返回
				MenuDel();//返回上级菜单
			}
			Comm_Ram->ButtonVal&=~0x3F;//键使用后清0
			break;
		default:
			break;
	}
}

//-------------------------------------------------------------------------------------------------
// Function name:       Menu_7_1_1
// Descriptions:        IP及端口号设置
// input parameters:    无
// output parameters:   无
// Returned value:      无
//-------------------------------------------------------------------------------------------------
void Menu_7_1_1(void)//IP及端口号设置
{
	switch(Stack->MenuStack[MenuCount->Count].Task)//菜单任务计数
	{
		case 0://任务0:初始化
			Stack->MenuStack[MenuCount->Count].Task=1;
			DisplayMenu(Stack->MenuStack[MenuCount->Count].MoveRow,(u8 *)pMenu_7_1_1);//显示菜单
			Arrowhead();
			MenuNegative(Stack->MenuStack[MenuCount->Count].EditRow);//反显菜单行
			break;
		case 1://任务1:选择
			MenuSelect();//菜单选择
			if((Comm_Ram->ButtonVal&0x10)!=0)
			{//确认
				switch(Stack->MenuStack[MenuCount->Count].EditRow+Stack->MenuStack[MenuCount->Count].MoveRow)
				{
					case 1:
						MenuCreate((u32)Menu_7_1_1_1);//主用IP及端口号设置
						break;
					case 2:
						MenuCreate((u32)Menu_7_1_1_2);//备用IP及端口号设置
						break;
					default:
						break;
				}              
			}
			if((Comm_Ram->ButtonVal&0x20)!=0)
			{//返回
				MenuDel();//返回上级菜单
			}
			Comm_Ram->ButtonVal&=~0x3F;//键使用后清0
			break;
		default:
			break;
	}
}

//-------------------------------------------------------------------------------------------------
// Function name:       Menu_7_1_1_1
// Descriptions:        主用IP及端口号设置
// input parameters:    无
// output parameters:   无
// Returned value:      无
//-------------------------------------------------------------------------------------------------
void Menu_7_1_1_1(void)//主用IP及端口号设置
{
	u8 *p,*p8;
	u8 MasterAddrValue[6];
	u16 *p16;
	u32 i,j,x,Ln;
	CommunicationParaStruct CommPara;
	MenuCount_TypeDef* pMenuCount = MenuCount;
	TerminalRunTimeCtrlStruct* pTSysCtrl = (TerminalRunTimeCtrlStruct*)ADDR_Terminal_RunTime;
	Ln=0;//菜单从第0行开始
	
	
	switch(Stack->MenuStack[MenuCount->Count].Task)//菜单任务计数
	{
		case 0://任务0:初始化
			Stack->MenuStack[MenuCount->Count].Task=1;
			DisplayClr();//清全屏
			MenuCount->v1=0;
			MenuCount->v2=0;
			MenuCount->v3=0;
			DisplayMenu(Stack->MenuStack[MenuCount->Count].MoveRow,(u8 *)pMenu_7_1_1_1);//显示菜单
			
