gdgly/NUC97X_JS/STM32F4xx/CSG/MenuCSG/Menu_7_ParametersSetting.c
			MR((u32)&CommPara,ADDR_CommunicationPara,sizeof(CommunicationParaStruct));			
			//显示内存中数据
			//主站端口号
			p16=(u16*)ADDR_DATABUFF;
			MR(ADDR_DATABUFF,(u32)&CommPara.MasterAddr,2);		
			p=(u8*)(ADDR_STRINGBUFF+(Ln+1)*84+4+9*2);			
			bcd_p8(p,p16[0],5);
			//主用IP类型			
			switch(CommPara.MasterAddrType)
			{
				case 2:
					DisplayString(Ln+2,11,0," GPRS ");
					pMenuCount->v3 = MASTER_CH_TYPE_GPRS;
					break;
				case 4:
					DisplayString(Ln+2,11,0,"以太网");	
					pMenuCount->v3 = MASTER_CH_TYPE_ETHE;
					break;
				default:
					DisplayString(Ln+2,11,0," 无效 ");
					pMenuCount->v3 = 0xFF;
					break;
			}
			//主站IP地址	
			p8=(u8*)ADDR_DATABUFF;			
			MR(ADDR_DATABUFF,(u32)&CommPara.MasterAddr[2],4);
			p=(u8*)(ADDR_STRINGBUFF+(Ln+3)*84+4+5*2);
			for(i = 0; i <= 3; i++)
			{
				bcd_p8(p+i*8,p8[3-i],3);
			}
			for(i=0;i<=2;i++)
			{
				p[3*2+i*8]='.';
				p[3*2+i*8+1]=0x20;
			}
			
			MenuCount->v1=9;
			MenuCount->v2=19;
			NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
			break;
		case 2:	
			if((Comm_Ram->ButtonVal&0x20)!=0)
			{//返回 
				Stack->MenuStack[MenuCount->Count].Task = 0;
				Stack->MenuStack[MenuCount->Count].MoveRow = 0;
				Stack->MenuStack[MenuCount->Count].EditRow = 1;
				Comm_Ram->ButtonVal&=~0x20;//键使用后清0
			}			
			break;
		case 1://任务1:选择
			for(j=0;j<2;j++)
			{
				if(Stack->MenuStack[MenuCount->Count].EditCol==0)
				{
					BoxSelect();
					if((Stack->MenuStack[MenuCount->Count].EditRow+Stack->MenuStack[MenuCount->Count].MoveRow)!=4)
					{
						DisplayClrRow_4(Ln+4);//清屏幕显示的指定行(4个控制字不清)
						DisplayString(Ln+4,6,0,"确认设置");
					}
					switch(Stack->MenuStack[MenuCount->Count].EditRow+Stack->MenuStack[MenuCount->Count].MoveRow)
					{
						case 1:
							MenuCount->v1=9;
							MenuCount->v2=19;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 2:
							MenuCount->v1=11;
							MenuCount->v2=19;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 3:
							MenuCount->v1=5;
							MenuCount->v2=19;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;						
						case 4:
							MenuCount->v1=0;
							MenuNegative(Stack->MenuStack[MenuCount->Count].EditRow);
							break;
						default:
							break;
					}	
					if(((Comm_Ram->ButtonVal&0x08)!=0) || ((Comm_Ram->ButtonVal&0x04)!=0))
					{//右键 或 左键
						switch(Stack->MenuStack[MenuCount->Count].EditRow+Stack->MenuStack[MenuCount->Count].MoveRow)
						{
							case 2:		// 编辑主站端口 IP 类型
								x = pMenuCount->v3;
								if(x == MASTER_CH_TYPE_GPRS)
								{
									pMenuCount->v3 = MASTER_CH_TYPE_ETHE;
									DisplayString(2,11,0,"以太网");									
								}
								else
								{
									pMenuCount->v3 = MASTER_CH_TYPE_GPRS;
									DisplayString(2,11,0," GPRS ");	
								}
								break;	
							default:
								break;
						}
					}
					if((Comm_Ram->ButtonVal&0x10)!=0)
					{//确认
						switch(Stack->MenuStack[MenuCount->Count].EditRow+Stack->MenuStack[MenuCount->Count].MoveRow)
						{
							case 1:
								Stack->MenuStack[MenuCount->Count].EditCol=MenuCount->v1;
								break;
							case 2:
								break;
							case 3:
								Stack->MenuStack[MenuCount->Count].EditCol=MenuCount->v1;
								break;
							case 4:
								MR((u32)&CommPara,ADDR_CommunicationPara,sizeof(CommunicationParaStruct));	
								p=(u8*)(ADDR_STRINGBUFF+(Ln+1)*84+4+9*2);
								x=p8_bcd(p,5);
								if(x<=1024)
								{
									DisplayClrRow(1,4);//清屏幕显示的指定行
									DisplayString(4,2,0,"提示:端口号>1024");
									Stack->MenuStack[MenuCount->Count].Task=2;								
								}
								else
								{
									p8=(u8*)&x;
									MR((u32)&MasterAddrValue,(u32)p8,2);
									//MR((u32)&CommPara.MasterAddr,(u32)p8,2);		// 保存端口
									//CommPara.MasterAddrType = pMenuCount->v3;		// 保存 IP 类型							
									p=(u8*)(ADDR_STRINGBUFF+(Ln+3)*84+4+5*2);		// 主站IP地址
									for(i = 0; i < 4; i++)
									{
										p8[3 - i] = p8_bcd(p+8*i, 3);
									}
									MR((u32)&MasterAddrValue[2],(u32)p8,4);
									//
									if((MemCompare(CommPara.MasterAddr, MasterAddrValue, 6) != 0) 
										 ||(CommPara.MasterAddrType != pMenuCount->v3))
									{
										pTSysCtrl->Flag |= TERMINAL_COMM_PARA_CHANGE_FLAG;
									}
									//
									MR((u32)&CommPara.MasterAddr,(u32)&MasterAddrValue,6);   // 设置端口、IP地址
									CommPara.MasterAddrType = pMenuCount->v3;                // 设置IP类型	
									MW((u32)&CommPara,ADDR_CommunicationPara,sizeof(CommunicationParaStruct));
									
									DisplayClrRow_4(4);//清屏幕显示的指定行(4个控制字不清)
									DisplayString(4,9,0,"OK");
								}
								break;							
							default:
								break;
						}
						Comm_Ram->ButtonVal&=~0x1F;//键使用后清0
					}
					else
					{
						Comm_Ram->ButtonVal&=~0x0F;//键使用后清0
						break;
					}
				}
				else//if(Stack->MenuStack[MenuCount->Count].EditCol!=0)
				{
					Select(MenuCount->v2,MenuCount->v1);
					UpDownSelect();
					if((Comm_Ram->ButtonVal&0x10)!=0)
					{//确认
						switch(Stack->MenuStack[MenuCount->Count].EditRow+Stack->MenuStack[MenuCount->Count].MoveRow)
						{
							case 1://主站端口
								p16=(u16 *)(ADDR_STRINGBUFF+(Ln+1)*84+4+16*2);
								p16[0]=0x2020;
								p16[1]=0x2020;
								p16[2]=32;//'左右箭头'
								p16[3]=33;
								p8=(u8 *)(ADDR_STRINGBUFF+(Ln+1)*84+4+9*2);
								x=p8_bcd(p8,5);
								if(x>65535)
								{
									bcd_p8(p8,0,5);
								}
								break;
							case 2://主站IP类型
								break;
							case 3://主站IP地址							
								p8=(u8 *)(ADDR_STRINGBUFF+(Ln+3)*84+4+5*2);
								x=p8_bcd(p8,3);
								if(x>255)
								{
									bcd_p8(p8,0,3);
								}
								x=p8_bcd(p8+4*2,3);
								if(x>255)
								{
									bcd_p8(p8+4*2,0,3);
								}
								x=p8_bcd(p8+8*2,3);
								if(x>255)
								{
									bcd_p8(p8+8*2,0,3);
								}
								x=p8_bcd(p8+12*2,3);
								if(x>255)
								{
									bcd_p8(p8+12*2,0,3);
								}
								break;
							default:
								break;
						}
						Stack->MenuStack[MenuCount->Count].EditCol=0;
						Comm_Ram->ButtonVal&=~0x1F;//键使用后清0
					}
					else
					{
						Comm_Ram->ButtonVal&=~0x0F;//键使用后清0
						break;
					}
				}
			}
			if((Comm_Ram->ButtonVal&0x20)!=0)
			{//返回
				MenuDel();//返回上级菜单
			}
			Comm_Ram->ButtonVal&=~0x20;//键使用后清0
			break;
		default:
			break;
	}
}	

//-------------------------------------------------------------------------------------------------
// Function name:       Menu_7_1_1_2
// Descriptions:        备用IP及端口号设置
// input parameters:    无
// output parameters:   无
// Returned value:      无
//-------------------------------------------------------------------------------------------------
void Menu_7_1_1_2(void)//备用IP及端口号设置
{
	u8 *p,*p8;
	u8 MasterBackAddrValue1[6];
	u8 MasterBackAddrValue2[6];
	u16 *p16;
	u32 i,j,x,Ln,CommType1,CommType2;
	CommunicationParaStruct CommPara;
	TerminalRunTimeCtrlStruct* pTSysCtrl = (TerminalRunTimeCtrlStruct*)ADDR_Terminal_RunTime;
	MenuCount_TypeDef* pMenuCount = MenuCount;
	Ln=0;//菜单从第0行开始

	
	switch(Stack->MenuStack[MenuCount->Count].Task)//菜单任务计数
	{
		case 0://任务0:初始化
			Stack->MenuStack[MenuCount->Count].Task=1;
			DisplayClr();//清全屏
			MenuCount->v1=0;
			MenuCount->v2=0;
			MenuCount->v3=0;
			DisplayMenu(Stack->MenuStack[MenuCount->Count].MoveRow,(u8 *)pMenu_7_1_1_2);//显示菜单
					
