gdgly/NUC97X_JS/STM32F4xx/CSG/MenuCSG/Menu_7_ParametersSetting.c
			MR((u32)&CommPara,ADDR_CommunicationPara,sizeof(CommunicationParaStruct));		
			//显示内存中数据
			//备用IP1端口号
			p16=(u16*)ADDR_DATABUFF;
			MR(ADDR_DATABUFF,(u32)&CommPara.MasterBackAddr1,2);
			p=(u8*)(ADDR_STRINGBUFF+(Ln+1)*84+4+10*2);			
			bcd_p8(p,p16[0],5);	
			//备用IP1类型
			switch(CommPara.MasterBackAddr1Type)
			{
				case 2:
					DisplayString(Ln+2,11,0," GPRS ");
					pMenuCount->v3 &= 0xFFFFFF00;
					pMenuCount->v3 |= MASTER_CH_TYPE_GPRS;
					break;
				case 4:
					DisplayString(Ln+2,11,0,"以太网");	
					pMenuCount->v3 &= 0xFFFFFF00;
					pMenuCount->v3 |= MASTER_CH_TYPE_ETHE;
					break;
				default:
					DisplayString(Ln+2,11,0," 无效 ");
					pMenuCount->v3 &= 0xFFFFFF00;
					pMenuCount->v3 |= 0xFF;
					break;
			}
			//备用IP1地址
			p8=(u8*)ADDR_DATABUFF;
			MR(ADDR_DATABUFF,(u32)&CommPara.MasterBackAddr1[2],4);			
			p=(u8*)(ADDR_STRINGBUFF+(Ln+3)*84+4+5*2);			
			for(i = 0; i <= 3; i++)
			{
				bcd_p8(p+i*8,p8[3 - i],3);
			}
			for(i=0;i<=2;i++)
			{
				p[3*2+i*8]='.';
				p[3*2+i*8+1]=0x20;
			}
			//备用IP2端口号
			p16=(u16*)ADDR_DATABUFF;
			MR(ADDR_DATABUFF,(u32)&CommPara.MasterBackAddr2,2);
			p=(u8*)(ADDR_STRINGBUFF+(Ln+4)*84+4+10*2);			
			bcd_p8(p,p16[0],5);
			//备用IP2类型		
			switch(CommPara.MasterBackAddr2Type)
			{
				case 2:
					DisplayString(Ln+5,11,0," GPRS ");
					pMenuCount->v3 &= 0xFFFF00FF;
					pMenuCount->v3 |= MASTER_CH_TYPE_GPRS << 8;
					break;
				case 4:
					DisplayString(Ln+5,11,0,"以太网");	
					pMenuCount->v3 &= 0xFFFF00FF;
					pMenuCount->v3 |= MASTER_CH_TYPE_ETHE << 8;
					break;
				default:
					DisplayString(Ln+5,11,0," 无效 ");
					pMenuCount->v3 &= 0xFFFF00FF;
					pMenuCount->v3 |= 0xFF00;
					break;
			}
			//备用IP2地址
			p8=(u8*)ADDR_DATABUFF;
			MR(ADDR_DATABUFF,(u32)&CommPara.MasterBackAddr2[2],4);
			p=(u8*)(ADDR_STRINGBUFF+(Ln+6)*84+4+5*2);
			for(i = 0; i <= 3; i++)
			{
				bcd_p8(p+i*8,p8[3 - i],3);
			}
			for(i=0;i<=2;i++)
			{
				p[3*2+i*8]='.';
				p[3*2+i*8+1]=0x20;
			}
						
			MenuCount->v1=10;
			MenuCount->v2=19;
			NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
			break;
		case 2:	
			if((Comm_Ram->ButtonVal&0x20)!=0)
			{//返回 
				Stack->MenuStack[MenuCount->Count].Task = 0;
				Stack->MenuStack[MenuCount->Count].MoveRow = 0;
				Stack->MenuStack[MenuCount->Count].EditRow = 1;
				Comm_Ram->ButtonVal&=~0x20;//键使用后清0
			}			
			break;
		case 1://任务1:选择
			for(j=0;j<2;j++)
			{
				if(Stack->MenuStack[MenuCount->Count].EditCol==0)
				{
					BoxSelect();
					if((Stack->MenuStack[MenuCount->Count].EditRow+Stack->MenuStack[MenuCount->Count].MoveRow)!=7)
					{
						DisplayClrRow_4(Ln+7);//清屏幕显示的指定行(4个控制字不清)
						DisplayString(Ln+7,6,0,"确认设置");
					}
					switch(Stack->MenuStack[MenuCount->Count].EditRow+Stack->MenuStack[MenuCount->Count].MoveRow)
					{
						case 1:
							MenuCount->v1=10;
							MenuCount->v2=19;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 2:
							MenuCount->v1=10;
							MenuCount->v2=19;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 3:
							MenuCount->v1=5;
							MenuCount->v2=19;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 4:
							MenuCount->v1=10;
							MenuCount->v2=19;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 5:
							MenuCount->v1=10;
							MenuCount->v2=19;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 6:
							MenuCount->v1=5;
							MenuCount->v2=19;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 7:
							MenuCount->v1=0;
							MenuNegative(Stack->MenuStack[MenuCount->Count].EditRow);
							break;
						default:
							break;
					}
					if(((Comm_Ram->ButtonVal&0x08)!=0) || ((Comm_Ram->ButtonVal&0x04)!=0))
					{//右键 或 左键
						switch(Stack->MenuStack[MenuCount->Count].EditRow+Stack->MenuStack[MenuCount->Count].MoveRow)
						{
							case 2:		// 编辑主站备用端口1 IP 类型
								x = pMenuCount->v3 & 0x000000FF;
								if(x == MASTER_CH_TYPE_GPRS)
								{
									pMenuCount->v3 &= 0xFFFFFF00;
									pMenuCount->v3 |= MASTER_CH_TYPE_ETHE;
									DisplayString(2,11,0,"以太网");									
								}
								else
								{
									pMenuCount->v3 &= 0xFFFFFF00;
									pMenuCount->v3 |= MASTER_CH_TYPE_GPRS;
									DisplayString(2,11,0," GPRS ");	
								}
								break;	
							case 5:		// 编辑主站备用端口2 IP 类型
								x = pMenuCount->v3 & 0x0000FF00;
								x >>= 8;
								if(x == MASTER_CH_TYPE_GPRS)
								{
									pMenuCount->v3 &= 0xFFFF00FF;
									pMenuCount->v3 |= MASTER_CH_TYPE_ETHE << 8;
									DisplayString(5,11,0,"以太网");									
								}
								else
								{
									pMenuCount->v3 &= 0xFFFF00FF;
									pMenuCount->v3 |= MASTER_CH_TYPE_GPRS << 8;
									DisplayString(5,11,0," GPRS ");	
								}
								break;	
							default:
								break;
						}
					}
					if((Comm_Ram->ButtonVal&0x10)!=0)
					{//确认
						switch(Stack->MenuStack[MenuCount->Count].EditRow+Stack->MenuStack[MenuCount->Count].MoveRow)
						{
							case 1:
								Stack->MenuStack[MenuCount->Count].EditCol=MenuCount->v1;
								break;
							case 2:
								break;
							case 3:
								Stack->MenuStack[MenuCount->Count].EditCol=MenuCount->v1;
								break;
							case 4:
								Stack->MenuStack[MenuCount->Count].EditCol=MenuCount->v1;
								break;
							case 5:
								break;
							case 6:
								Stack->MenuStack[MenuCount->Count].EditCol=MenuCount->v1;
								break;
							case 7:
								//保存设置的数据
								//备用IP1端口
								MR((u32)&CommPara,ADDR_CommunicationPara,sizeof(CommunicationParaStruct));
								p=(u8*)(ADDR_STRINGBUFF+(Ln+1)*84+4+10*2);
								x=p8_bcd(p,5);
								if(x<=1024)
								{
									DisplayClrRow(1,7);//清屏幕显示的指定行
									DisplayString(4,1,0,"提示:端口号1>1024");
									Stack->MenuStack[MenuCount->Count].Task=2;		
								}
								else
								{
									p8=(u8*)&x;		
									MR((u32)&MasterBackAddrValue1,(u32)p8,2);										
									//备用IP1类型
									CommType1 = pMenuCount->v3&0x000000FF;
									//备用IP1地址
									p=(u8*)(ADDR_STRINGBUFF+(Ln+3)*84+4+5*2);
									for(i=0;i<=3;i++)
									{
										p8[3 - i]=p8_bcd(p+8*i,3);
									}
									MR((u32)&MasterBackAddrValue1[2],(u32)p8,4);										
									//备用IP2端口
									p=(u8*)(ADDR_STRINGBUFF+(Ln+4)*84+4+10*2);
									x=p8_bcd(p,5);
									if(x<=1024)
									{
										DisplayClrRow(1,7);//清屏幕显示的指定行
										DisplayString(4,1,0,"提示:端口号2>1024");
										Stack->MenuStack[MenuCount->Count].Task=2;		
									}
									else
									{
										p8=(u8*)&x;
										MR((u32)&MasterBackAddrValue2,(u32)p8,2);										
										//备用IP2类型
										CommType2 = pMenuCount->v3 >> 8;
										//备用IP2地址
										p=(u8*)(ADDR_STRINGBUFF+(Ln+6)*84+4+5*2);
										for(i=0;i<=3;i++)
										{
											p8[3 - i]=p8_bcd(p+8*i,3);
										}
										MR((u32)&MasterBackAddrValue2[2],(u32)p8,4);
										
										if((MemCompare(CommPara.MasterBackAddr1, MasterBackAddrValue1, 6) != 0) 
										||(CommPara.MasterBackAddr1Type != CommType1)
										||(MemCompare(CommPara.MasterBackAddr2, MasterBackAddrValue2, 6) != 0) 
										||(CommPara.MasterBackAddr2Type != CommType2))
										{
											pTSysCtrl->Flag |= TERMINAL_COMM_PARA_CHANGE_FLAG;
										}
										
