gdgly/NUC97X_JS/STM32F4xx/CSG/MenuCSG/Menu_7_ParametersSetting.c
										MR((u32)&CommPara.MasterBackAddr1,(u32)&MasterBackAddrValue1,6);   // 设置备用1端口、IP地址
										CommPara.MasterBackAddr1Type = CommType1;                               // 设置备用1 IP类型	
										MR((u32)&CommPara.MasterBackAddr2,(u32)&MasterBackAddrValue2,6);   // 设置备用2端口、IP地址
										CommPara.MasterBackAddr2Type = CommType2;											         // 设置备用2 IP类型	
										MW((u32)&CommPara,ADDR_CommunicationPara,sizeof(CommunicationParaStruct));
										
										DisplayClrRow_4(7);//清屏幕显示的指定行(4个控制字不清)
										DisplayString(7,9,0,"OK");
									}
								}
								break;
							default:
								break;
						}
						Comm_Ram->ButtonVal&=~0x1F;//键使用后清0
					}
					else
					{
						Comm_Ram->ButtonVal&=~0x0F;//键使用后清0
						break;
					}
				}
				else//if(Stack->MenuStack[MenuCount->Count].EditCol!=0)
				{
					Select(MenuCount->v2,MenuCount->v1);
					UpDownSelect();
					if((Comm_Ram->ButtonVal&0x10)!=0)
					{//确认
						switch(Stack->MenuStack[MenuCount->Count].EditRow+Stack->MenuStack[MenuCount->Count].MoveRow)
						{
							case 1://备用IP1端口
								p16=(u16 *)(ADDR_STRINGBUFF+(Ln+1)*84+4+16*2);
								p16[0]=0x2020;
								p16[1]=0x2020;
								p16[2]=32;//'左右箭头'
								p16[3]=33;
								p8=(u8 *)(ADDR_STRINGBUFF+(Ln+1)*84+4+10*2);
								x=p8_bcd(p8,5);
								if(x>65535)
								{
									bcd_p8(p8,0,5);
								}
								break;
							case 2://备用IP1类型
								break;
							case 3://备用IP1地址
								p8=(u8*)(ADDR_STRINGBUFF+(Ln+3)*84+4+5*2);
								x=p8_bcd(p8,3);
								if(x>255)
								{
									bcd_p8(p8,0,3);
								}
								x=p8_bcd(p8+4*2,3);
								if(x>255)
								{
									bcd_p8(p8+4*2,0,3);
								}
								x=p8_bcd(p8+8*2,3);
								if(x>255)
								{
									bcd_p8(p8+8*2,0,3);
								}
								x=p8_bcd(p8+12*2,3);
								if(x>255)
								{
									bcd_p8(p8+12*2,0,3);
								}
								break;
							case 4://备用IP2端口
								p16=(u16 *)(ADDR_STRINGBUFF+(Ln+4)*84+4+16*2);
								p16[0]=0x2020;
								p16[1]=0x2020;
								p16[2]=32;//'左右箭头'
								p16[3]=33;
								p8=(u8 *)(ADDR_STRINGBUFF+(Ln+4)*84+4+10*2);
								x=p8_bcd(p8,5);
								if(x>65535)
								{
									bcd_p8(p8,0,5);
								}
								break;
							case 5://备用IP2类型
								break;
							case 6://备用IP2地址
								p8=(u8*)(ADDR_STRINGBUFF+(Ln+6)*84+4+5*2);
								x=p8_bcd(p8,3);
								if(x>255)
								{
									bcd_p8(p8,0,3);
								}
								x=p8_bcd(p8+4*2,3);
								if(x>255)
								{
									bcd_p8(p8+4*2,0,3);
								}
								x=p8_bcd(p8+8*2,3);
								if(x>255)
								{
									bcd_p8(p8+8*2,0,3);
								}
								x=p8_bcd(p8+12*2,3);
								if(x>255)
								{
									bcd_p8(p8+12*2,0,3);
								}
								break;
							default:
								break;
						}
						Stack->MenuStack[MenuCount->Count].EditCol=0;
						Comm_Ram->ButtonVal&=~0x1F;//键使用后清0
					}
					else
					{
						Comm_Ram->ButtonVal&=~0x0F;//键使用后清0
						break;
					}
				}
			}
			if((Comm_Ram->ButtonVal&0x20)!=0)
			{//返回
				MenuDel();//返回上级菜单
			}
			Comm_Ram->ButtonVal&=~0x20;//键使用后清0
			break;
		default:
			break;
	}
}	


//-------------------------------------------------------------------------------------------------
// Function name:       Menu_7_1_2
// Descriptions:        通信方式设置
// input parameters:    无
// output parameters:   无
// Returned value:      无
//-------------------------------------------------------------------------------------------------
void Menu_7_1_2(void)//通信方式设置
{
	u8 *p,*p8;
	u8 m[2]={0};
	u16 *p16;
	u32 j,i,x,Ln;
	CommunicationParaStruct CommPara;
	MenuCount_TypeDef* pMenuCount = MenuCount;
	Ln=0;//菜单从第0行开始


	switch(Stack->MenuStack[MenuCount->Count].Task)//菜单任务计数
	{
		case 0://任务0:初始化
			Stack->MenuStack[MenuCount->Count].Task=1;
			DisplayClr();//清全屏
			MenuCount->v1=0;
			MenuCount->v2=0;
			MenuCount->v3=0;
			DisplayMenu(Stack->MenuStack[MenuCount->Count].MoveRow,(u8 *)pMenu_7_1_2);//显示菜单
			
			//显示内存中数据
			//连接方式
			MR((u32)&CommPara,ADDR_CommunicationPara,sizeof(CommunicationParaStruct));			
			switch(CommPara.IpLinkType)
			{
				case 0:
					DisplayString(Ln+1,9,0," TCP  ");
					pMenuCount->v3 = 0x00;
					break;
				case 1:
					DisplayString(Ln+1,9,0," UDP  ");	
					pMenuCount->v3 = 0x01;
					break;
				default:
					DisplayString(Ln+1,9,0," 无效 ");
					pMenuCount->v3 = 0xFF;
					break;
			}
			//重拨间隔
			p8=(u8*)ADDR_DATABUFF;
			MR((u32)p8,(u32)&CommPara.RedialTimeGap,1);
			p=(u8*)(ADDR_STRINGBUFF+(Ln+2)*84+4+13*2);
			DisplayData(p8[0],2,0,(u16*)p);
			//重拨次数
			p8=(u8*)ADDR_DATABUFF;
			MR((u32)p8,(u32)&CommPara.RedialCnt,1);
			p=(u8*)(ADDR_STRINGBUFF+(Ln+3)*84+4+13*2);
			DisplayData(p8[0],2,0,(u16*)p);		
			//心跳周期
			if(BCD_Check(&CommPara.HeartBeatTimeGap,1) != NO_ERROR)
			{		
				CommPara.HeartBeatTimeGap = 0;
				MW((u32)&CommPara,ADDR_CommunicationPara,sizeof(CommunicationParaStruct));				
				MR((u32)&CommPara,ADDR_CommunicationPara,sizeof(CommunicationParaStruct));
				p8=(u8*)ADDR_DATABUFF;
				MR((u32)p8,(u32)&CommPara.HeartBeatTimeGap,1);
				p=(u8*)(ADDR_STRINGBUFF+(Ln+4)*84+4+13*2);
				DisplayData(p8[0],2,0,(u16*)p);
			}
			else
			{
				p8=(u8*)ADDR_DATABUFF;
				MR((u32)p8,(u32)&CommPara.HeartBeatTimeGap,1);
				p=(u8*)(ADDR_STRINGBUFF+(Ln+4)*84+4+13*2);
				DisplayData(p8[0],2,0,(u16*)p);
			}
					
			MenuCount->v1=9;
			MenuCount->v2=14;
			NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
			break;	
		case 1://任务1:选择
			for(j=0;j<2;j++)
			{
				if(Stack->MenuStack[MenuCount->Count].EditCol==0)
				{
					BoxSelect();
					if(Stack->MenuStack[MenuCount->Count].EditRow!=5)
					{
						DisplayString(Ln+5,6,0,"确认设置");
					}
					switch(Stack->MenuStack[MenuCount->Count].EditRow)
					{
						case 1:
							MenuCount->v1=9;
							MenuCount->v2=14;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 2:
							MenuCount->v1=13;
							MenuCount->v2=14;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 3:
							MenuCount->v1=13;
							MenuCount->v2=14;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 4:
							MenuCount->v1=13;
							MenuCount->v2=14;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 5:
							MenuCount->v1=0;
							MenuNegative(Stack->MenuStack[MenuCount->Count].EditRow);
							break;
						default:
							break;
					}		
					if(((Comm_Ram->ButtonVal&0x08)!=0) || ((Comm_Ram->ButtonVal&0x04)!=0))
					{//右键 或 左键
						switch(Stack->MenuStack[MenuCount->Count].EditRow+Stack->MenuStack[MenuCount->Count].MoveRow)
						{
							case 1:	// 编辑连接方式
								x = pMenuCount->v3;
								if(x == 0x01)
								{
									pMenuCount->v3 = 0x00;
									DisplayString(1,9,0," TCP  ");									
								}
								else
								{
									pMenuCount->v3 = 0x01;
									DisplayString(1,9,0," UDP  ");	
								}
								break;	
							default:
								break;
						}
					}					
					if((Comm_Ram->ButtonVal&0x10)!=0)
					{//确认
						switch(Stack->MenuStack[MenuCount->Count].EditRow)
						{
							case 1:
								break;
							case 2:
								Stack->MenuStack[MenuCount->Count].EditCol=MenuCount->v1;
								DisplayString(Ln+Stack->MenuStack[MenuCount->Count].EditRow,16,0,"输入");
								break;
							case 3:
								Stack->MenuStack[MenuCount->Count].EditCol=MenuCount->v1;
								DisplayString(Ln+Stack->MenuStack[MenuCount->Count].EditRow,16,0,"输入");
								break;
							case 4:
								Stack->MenuStack[MenuCount->Count].EditCol=MenuCount->v1;
								DisplayString(Ln+Stack->MenuStack[MenuCount->Count].EditRow,16,0,"输入");
								break;
							case 5:
								//保存设置的数据
								MR((u32)&CommPara,ADDR_CommunicationPara,sizeof(CommunicationParaStruct));
								//连接方式
								CommPara.IpLinkType = pMenuCount->v3;
								//重拨间隔
								p=(u8*)(ADDR_STRINGBUFF+(Ln+2)*84+4+13*2);
								for(i=0;i<2;i++)
								{
									m[i]=(u32)CharToHex(p[2*i]);
								}
								m[0]=m[0]<<4;
								CommPara.RedialTimeGap=m[0]|m[1];
								//重拨次数
								MC(0,m[0],2);
								p=(u8*)(ADDR_STRINGBUFF+(Ln+3)*84+4+13*2);
								for(i=0;i<2;i++)
								{
									m[i]=(u32)CharToHex(p[2*i]);
								}
								m[0]=m[0]<<4;
								CommPara.RedialCnt=m[0]|m[1];
								//心跳周期
								MC(0,m[0],2);
								p=(u8*)(ADDR_STRINGBUFF+(Ln+4)*84+4+13*2);
								for(i=0;i<2;i++)
								{
									m[i]=(u32)CharToHex(p[2*i]);
								}
								m[0]=m[0]<<4;
								CommPara.HeartBeatTimeGap=m[0]|m[1];
								
								
