gdgly/NUC97X_JS/STM32F4xx/CSG/MenuCSG/Menu_7_ParametersSetting.c
								MW((u32)&CommPara,ADDR_CommunicationPara,sizeof(CommunicationParaStruct));
								DisplayClrRow_4(Ln+5);//清屏幕显示的指定行(4个控制字不清)
								DisplayString(Ln+5,9,0,"OK");
								break;
							default:
								break;
						}
						Comm_Ram->ButtonVal&=~0x1F;//键使用后清0
					}
					else
					{
						Comm_Ram->ButtonVal&=~0x0F;//键使用后清0
						break;
					}
				}
				else//if(Stack->MenuStack[MenuCount->Count].EditCol!=0)
				{
					Select(MenuCount->v2,MenuCount->v1);
					UpDownSelect();
					if((Comm_Ram->ButtonVal&0x10)!=0)
					{//确认
						switch(Stack->MenuStack[MenuCount->Count].EditRow)
						{
							case 1:
								break;
							case 2:
								p16=(u16 *)(ADDR_STRINGBUFF+(Ln+Stack->MenuStack[MenuCount->Count].EditRow)*84+4+16*2);
								p16[0]=0x2020;
								p16[1]=0x2020;
								p16[2]=32;//'左右箭头'
								p16[3]=33;
								p8=(u8 *)(ADDR_STRINGBUFF+(Ln+2)*84+4+13*2);
								x=p8_bcd(p8,2);
								if(x>99)
								{
									bcd_p8(p8,0,2);
								}
								break;
							case 3:
								p16=(u16 *)(ADDR_STRINGBUFF+(Ln+Stack->MenuStack[MenuCount->Count].EditRow)*84+4+16*2);
								p16[0]=0x2020;
								p16[1]=0x2020;
								p16[2]=32;//'左右箭头'
								p16[3]=33;
								p8=(u8 *)(ADDR_STRINGBUFF+(Ln+3)*84+4+13*2);
								x=p8_bcd(p8,2);
								if(x>99)
								{
									bcd_p8(p8,0,2);
								}
								break;
							case 4:
								p16=(u16 *)(ADDR_STRINGBUFF+(Ln+Stack->MenuStack[MenuCount->Count].EditRow)*84+4+16*2);
								p16[0]=0x2020;
								p16[1]=0x2020;
								p16[2]=32;//'左右箭头'
								p16[3]=33;
								p8=(u8 *)(ADDR_STRINGBUFF+(Ln+4)*84+4+13*2);
								x=p8_bcd(p8,2);
								if(x>99)
								{
									bcd_p8(p8,0,2);
								}
								break;
						}
						Stack->MenuStack[MenuCount->Count].EditCol=0;
						Comm_Ram->ButtonVal&=~0x1F;//键使用后清0
					}
					else
					{
						Comm_Ram->ButtonVal&=~0x0F;//键使用后清0
						break;
					}
				}
			}
			if((Comm_Ram->ButtonVal&0x20)!=0)
			{//返回
				MenuDel();//返回上级菜单
			}
			Comm_Ram->ButtonVal&=~0x20;//键使用后清0
			break;
		default:
			break;
	}
}	



//-------------------------------------------------------------------------------------------------
// Function name:       Menu_7_1_3
// Descriptions:        APN设置
// input parameters:    无
// output parameters:   无
// Returned value:      无
//-------------------------------------------------------------------------------------------------
void Menu_7_1_3(void)//APN设置
{
	u8 *p,*p8;
	u32 i,j,k;
	u32 MinLn=4;           //软键盘最小行号
	u32 MaxLn=8;           //软键盘最大行号
	u32 LastLnMaxCol=14;   //软键盘的最后一行最大列号
	u32 MinCol=0;          //软键盘最小列号
	u32 MaxCol=19;         //软键盘最大行号
	u32 EditLn=2;
	u32 EditCol=0;
	u32 EditLength=19;	
	u32 Ln=0;              //菜单从第0行开始
	CommunicationParaStruct CommPara;
	TerminalRunTimeCtrlStruct* pTSysCtrl = (TerminalRunTimeCtrlStruct*)ADDR_Terminal_RunTime;
	
	
	switch(Stack->MenuStack[MenuCount->Count].Task)//菜单任务计数
	{
		case 0://任务0:初始化
			Stack->MenuStack[MenuCount->Count].Task=1;
			DisplayClr();//清全屏
			p8=" 0123456789abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ~`!@#$%^&*()_+-={}[]|:;'\",.?/\\<>";
			DisplayString(Ln+1,7,0,"APN设置");			
			DisplayString(MinLn,MinCol,0,p8);
			//显示内存中的数据
			MC(0,(u32)&CommPara,sizeof(CommunicationParaStruct));
			MC(0,ADDR_DATABUFF,100);
			MR((u32)&CommPara,ADDR_CommunicationPara,sizeof(CommunicationParaStruct));
			p=(u8*)ADDR_DATABUFF;
			MR(ADDR_DATABUFF,(u32)&CommPara.APN,16);
			for(k=0;k<=15;k++)
			{
				if((p[k]==0x5E)||(p[k]==0x5F)||(p[k]==0xFF)||(p[k]==0x7F))
				{
					p[k]=0x20;
				}
				else
				{
					DisplayString(EditLn,EditCol,0,p);
				}
			}					
			Comm_Ram->DisplayScanTimer=0;//2 显示扫描10MS定时器
			NegativeLnCol(EditLn,Stack->MenuStack[MenuCount->Count].MoveRow+EditCol);
			break;
		case 1://任务1:键盘选择
			KeyboardSelect(MinLn,MaxLn,LastLnMaxCol,MinCol,MaxCol,EditLn,EditCol);//键盘选择
			break;
		case 2://任务2:编辑框选择
			if((Comm_Ram->ButtonVal&0x01)!=0)
			{//下键
				Stack->MenuStack[MenuCount->Count].EditRow = 4;
				Stack->MenuStack[MenuCount->Count].EditCol = 0;
				p=(u8*)(ADDR_STRINGBUFF+4*84+4+(Stack->MenuStack[MenuCount->Count].EditCol)*2);
				*p|=0x8000;
				Stack->MenuStack[MenuCount->Count].Task = 1;
			}
			else
			{
				if((Comm_Ram->ButtonVal&0x08)!=0)
				{//右键
					Stack->MenuStack[MenuCount->Count].MoveRow ++;
					if(Stack->MenuStack[MenuCount->Count].MoveRow == EditLength)
					{
						Stack->MenuStack[MenuCount->Count].MoveRow = 0;
					}
				}
				if((Comm_Ram->ButtonVal&0x04)!=0)
				{//左键
					if(Stack->MenuStack[MenuCount->Count].MoveRow > 0)
					{
						Stack->MenuStack[MenuCount->Count].MoveRow --;
					}
					else
					{
						Stack->MenuStack[MenuCount->Count].MoveRow = EditLength-1;
					}
				}
				NegativeLnCol(EditLn,Stack->MenuStack[MenuCount->Count].MoveRow+EditCol);
				if((Comm_Ram->ButtonVal&0x10)!=0)
				{//确认
					//保存数据
					MR((u32)&CommPara,ADDR_CommunicationPara,sizeof(CommunicationParaStruct));
					p8=(u8 *)ADDR_DATABUFF;
					MC(0,ADDR_DATABUFF,100);
					p=(u8*)(ADDR_STRINGBUFF+(EditLn)*84+4+(EditCol)*2);
					for(i=0;i<=15;i++)
					{
						if(p[i*2]!=0x20 && p[i*2]!=0x00)
						{
							p8[i]=p[i*2];
						}
						else
						{
							for(j=i;j<=15;j++)
							{
								p8[j]=0x00;
							}
							break;
						}
					}
					if((MemCompare(CommPara.APN, p8, sizeof(CommPara.APN)) != 0))
					{
						pTSysCtrl->Flag |= TERMINAL_COMM_PARA_CHANGE_FLAG;
					}
					MR((u32)&CommPara.APN,(u32)p8,sizeof(CommPara.APN));
					MW((u32)&CommPara,ADDR_CommunicationPara,sizeof(CommunicationParaStruct));
					DisplayClrRow(1,9);
					DisplayString(2,0,0,p8);
					DispalyAlign(2,0,2);//行显示对齐(1左对齐,2居中,3右对齐)
					DisplayString(4,7,0,"设置OK");
					DisplayString(5,4,0,"按任意键退出");
					Stack->MenuStack[MenuCount->Count].Task=3;
				}
				if((Comm_Ram->ButtonVal&0x20)!=0)
				{//返回
					Stack->MenuStack[MenuCount->Count].MoveRow =0;
					MenuDel();//返回上级菜单
				}
			}
			Comm_Ram->ButtonVal&=~0x3D;//键使用后清0
			break;
		case 3://设置成功后按任意键退出
			Stack->MenuStack[MenuCount->Count].MoveRow =0;
			if((Comm_Ram->ButtonVal&0x3F)!=0)
			{
				Stack->MenuStack[MenuCount->Count].MoveRow =0;
				MenuDel();//返回上级菜单
			}
			Comm_Ram->ButtonVal&=~0x3F;//键使用后清0
			break;
		default:
			break;
	}	
}	

//-------------------------------------------------------------------------------------------------
// Function name:       Menu_7_1_4
// Descriptions:        专网用户名设置
// input parameters:    无
// output parameters:   无
// Returned value:      无
//-------------------------------------------------------------------------------------------------
void Menu_7_1_4(void)//专网用户名设置
{
	u8 *p,*p8;
	u16 *p16;
	u32 i,j,k;
	u32 EditLn=2;
	u32 EditCol=0;
	u32 EditLength=20;	
	u32 MinLn=4;            //软键盘最小行号
	u32 MaxLn=8;            //软键盘最大行号
	u32 MinCol=0;           //软键盘最小列号
	u32 MaxCol=19;          //软键盘最大列号
	u32 LastLnMaxCol=14;    //软键盘的最后一行最大列号
	CommunicationParaStruct CommPara;
	TerminalRunTimeCtrlStruct* pTSysCtrl = (TerminalRunTimeCtrlStruct*)ADDR_Terminal_RunTime;



	switch(Stack->MenuStack[MenuCount->Count].Task)//菜单任务计数
	{
		case 0://任务0:初始化
			Stack->MenuStack[MenuCount->Count].Task=2;
			DisplayClr();//清全屏
			p8=" 0123456789abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ~`!@#$%^&*()_+-={}[]|:;'\",.?/\\<>";
			DisplayString(1,3,0,"专网用户名设置");			
			DisplayString(MinLn,MinCol,0,p8);
			
			p=(u8 *)ADDR_DATABUFF;
			MC(0,ADDR_DATABUFF,100);
			MC(0,(u32)&CommPara,sizeof(CommunicationParaStruct));
			MR((u32)&CommPara,ADDR_CommunicationPara,sizeof(CommunicationParaStruct));
			MR((u32)p,(u32)&CommPara.APNUserName,32);
			for(k=0;k<=31;k++)
			{
				if((p[k]==0x5E)||(p[k]==0x5F)||(p[k]==0xFF)||(p[k]==0x7F))
				{
					p[k]=0x20;
				}
			}
			DisplayString(EditLn,EditCol,0,p);
			Comm_Ram->DisplayScanTimer=0;//2 显示扫描10MS定时器
			NegativeLnCol(EditLn,Stack->MenuStack[MenuCount->Count].MoveRow+EditCol);
			break;
		case 1://任务1:键盘选择
			KeyboardSelect(MinLn,MaxLn,LastLnMaxCol,MinCol,MaxCol,EditLn,EditCol);//键盘选择
			break;
		case 2://任务2:编辑框选择
			if((Comm_Ram->ButtonVal&0x01)!=0)
			{//下键
				Stack->MenuStack[MenuCount->Count].EditRow = 4;
				Stack->MenuStack[MenuCount->Count].EditCol = 0;
				p16=(u16 *)(ADDR_STRINGBUFF+(Stack->MenuStack[MenuCount->Count].EditRow)*84+4+(Stack->MenuStack[MenuCount->Count].EditCol)*2);
				*p16|=0x8000;
				Stack->MenuStack[MenuCount->Count].Task = 1;
			}
			else
			{
				if((Comm_Ram->ButtonVal&0x08)!=0)
				{//右键
					Stack->MenuStack[MenuCount->Count].MoveRow ++;
					if(Stack->MenuStack[MenuCount->Count].MoveRow == EditLength)
					{
						Stack->MenuStack[MenuCount->Count].MoveRow = 0;
					}
				}
				if((Comm_Ram->ButtonVal&0x04)!=0)
				{//左键
					if(Stack->MenuStack[MenuCount->Count].MoveRow > 0)
					{
						Stack->MenuStack[MenuCount->Count].MoveRow --;
					}
					else
					{
						Stack->MenuStack[MenuCount->Count].MoveRow = EditLength-1;
					}
				}
				NegativeLnCol(EditLn,Stack->MenuStack[MenuCount->Count].MoveRow+EditCol);
				if((Comm_Ram->ButtonVal&0x10)!=0)
				{//确认
					//保存数据
					MR((u32)&CommPara,ADDR_CommunicationPara,sizeof(CommunicationParaStruct));				
					p8=(u8 *)ADDR_DATABUFF;
					MC(0,ADDR_DATABUFF,100);
					p=(u8 *)(ADDR_STRINGBUFF+(EditLn)*84+4+(EditCol)*2);
					for(i=0;i<=31;i++)
					{
						if(p[i*2]!=0x20 && p[i*2]!=0x00)
						{
							p8[i]=p[i*2];
						}
						else
						{
								for(j=i;j<=31;j++)
								{
									p8[j]=0x00;
								}
								break;
						}
					}
					if((MemCompare(CommPara.APNUserName, p8, sizeof(CommPara.APNUserName)) != 0))
					{
						pTSysCtrl->Flag |= TERMINAL_COMM_PARA_CHANGE_FLAG;
					}
					MR((u32)&CommPara.APNUserName,(u32)p8,sizeof(CommPara.APNUserName));
					MW((u32)&CommPara,ADDR_CommunicationPara,sizeof(CommunicationParaStruct));			
					//设置成功提示OK
					DisplayClrRow(1,9);
					DisplayString(2,0,0,p8);
					DispalyAlign(2,0,2);//行显示对齐(1左对齐,2居中,3右对齐)
					DisplayString(4,7,0,"设置OK");
					DisplayString(5,4,0,"按任意键退出");
					Stack->MenuStack[MenuCount->Count].Task=3;
				}
				if((Comm_Ram->ButtonVal&0x20)!=0)
				{//返回
					Stack->MenuStack[MenuCount->Count].MoveRow =0;
					MenuDel();//返回上级菜单
				}
			}
			Comm_Ram->ButtonVal&=~0x3D;//键使用后清0
			break;
		case 3://设置成功后按任意键退出
			Stack->MenuStack[MenuCount->Count].MoveRow =0;
			if((Comm_Ram->ButtonVal&0x3F)!=0)
			{
				Stack->MenuStack[MenuCount->Count].MoveRow =0;
				MenuDel();//返回上级菜单
			}
			Comm_Ram->ButtonVal&=~0x3F;//键使用后清0
			break;
		default:
			break;
	}
}	

//-------------------------------------------------------------------------------------------------
// Function name:       Menu_7_1_5
// Descriptions:        专网密码设置
// input parameters:    无
// output parameters:   无
// Returned value:      无
//-------------------------------------------------------------------------------------------------
void Menu_7_1_5(void)//专网密码设置
{
	u8 *p,*p8;
	u16 *p16;
	u32 i,j,k;
	u32 MinLn=4;            //软键盘最小行号
	u32 MaxLn=8;            //软键盘最大行号
	u32 LastLnMaxCol=14;    //软键盘的最后一行最大列号
	u32 MinCol=0;           //软键盘最小列号
	u32 MaxCol=19;          //软键盘最大列号
	u32 EditLn=2;
	u32 EditCol=0;
	u32 EditLength=20;
	CommunicationParaStruct CommPara;
	TerminalRunTimeCtrlStruct* pTSysCtrl = (TerminalRunTimeCtrlStruct*)ADDR_Terminal_RunTime;


	switch(Stack->MenuStack[MenuCount->Count].Task)//菜单任务计数
	{
		case 0://任务0:初始化
			DisplayClr();//清全屏
			Stack->MenuStack[MenuCount->Count].Task=1;
			DisplayClr();//清全屏
			p8=" 0123456789abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ~`!@#$%^&*()_+-={}[]|:;'\",.?/\\<>";
			DisplayString(1,4,0,"专网密码设置");
			DisplayString(MinLn,MinCol,0,p8);
			
