gdgly/NUC97X_JS/STM32F4xx/CSG/MenuCSG/Menu_7_ParametersSetting.c
								MW((u32)&CommPara,ADDR_CommunicationPara,sizeof(CommunicationParaStruct));
								DisplayString(4,0,0,"         OK         ");					
								break;
							default:
								break;
						}						
						Comm_Ram->ButtonVal&=~0x1F;//键使用后清0
					}
					else
					{
						Comm_Ram->ButtonVal&=~0x0F;//键使用后清0
						break;
					}
				}
			}
			if((Comm_Ram->ButtonVal&0x20)!=0)
			{//返回
				MenuDel();//返回上级菜单
			}
			Comm_Ram->ButtonVal&=~0x20;//键使用后清0
			break;
		default:
			break;
	}
}



//-------------------------------------------------------------------------------------------------
// Function name:       Menu_7_1_7_1_1_1
// Descriptions:        普通卡联通
// input parameters:    无
// output parameters:   无
// Returned value:      无
//-------------------------------------------------------------------------------------------------
void Menu_7_1_7_1_1_2(void)// 普通卡联通
{
	u8 IPPORT[6] = {0x21,0x1C,0x2E,0x01,0x64,0xAC};
	u8 APNValue[16] = {'Y','N','D','W','.','F','K','.','Y','N','A','P','N'};
	u32 j = 0;	
	CommunicationParaStruct CommPara;
	TerminalRunTimeCtrlStruct* pTSysCtrl = (TerminalRunTimeCtrlStruct*)ADDR_Terminal_RunTime;
	
	switch(Stack->MenuStack[MenuCount->Count].Task)//菜单任务计数
	{
		case 0://任务0:初始化
			Stack->MenuStack[MenuCount->Count].Task=1;
			DisplayClr();//清全屏
			MenuCount->v1=0;
			MenuCount->v2=0;
			MenuCount->v3=0;
			DisplayMenu(Stack->MenuStack[MenuCount->Count].MoveRow,(u8 *)pMenu_7_1_7_1_1_1);//显示菜单	
			DisplayString(1,6,0,"172.100.1.46");      //IP地址
			DisplayString(2,6,0,"7201");						    //端口号		
			DisplayString(3,6,0,"YNDW.FK.YNAPN");						//APN				
			DisplayString(4,0,0,"      确认设置\n\r");
			MenuCount->v1=6;
			MenuCount->v2=17;
			NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
			break;
		case 2:
			if((Comm_Ram->ButtonVal&0x20)!=0)
			{//返回
				Stack->MenuStack[MenuCount->Count].Task = 0;
				Stack->MenuStack[MenuCount->Count].MoveRow = 0;
				Stack->MenuStack[MenuCount->Count].EditRow = 1;
				Comm_Ram->ButtonVal&=~0x20;
			}
			break;
		case 1://任务1:选择
			for(j=0;j<2;j++)
			{
				if(Stack->MenuStack[MenuCount->Count].EditCol==0)
				{
					BoxSelect();
					switch(Stack->MenuStack[MenuCount->Count].EditRow+Stack->MenuStack[MenuCount->Count].MoveRow)
					{
						case 1:
							MenuCount->v1=6;
							MenuCount->v2=17;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 2:
							MenuCount->v1=6;
							MenuCount->v2=9;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 3:
							MenuCount->v1=6;
							MenuCount->v2=18;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 4:
							MenuCount->v1=0;
							MenuNegative(Stack->MenuStack[MenuCount->Count].EditRow);
							break;
						default:
							break;
					}
					if((Comm_Ram->ButtonVal&0x10)!=0)
					{//确认						
						switch(Stack->MenuStack[MenuCount->Count].EditRow+Stack->MenuStack[MenuCount->Count].MoveRow)
						{
							case 1:
								Stack->MenuStack[MenuCount->Count].EditCol=MenuCount->v1;
								break;
							case 2:
							case 3:		
								break;
							case 4:
								//保存设置的数据
								MR((u32)&CommPara,ADDR_CommunicationPara,sizeof(CommunicationParaStruct));
								if((MemCompare(CommPara.MasterAddr, IPPORT, 6) != 0) 
									||(CommPara.MasterAddrType != MASTER_CH_TYPE_GPRS)
									||(MemCompare(CommPara.MasterBackAddr1, IPPORT, 6) != 0) 
									||(CommPara.MasterBackAddr1Type != MASTER_CH_TYPE_GPRS)
									||(MemCompare(CommPara.MasterBackAddr2, IPPORT, 6) != 0) 
									||(CommPara.MasterBackAddr2Type != MASTER_CH_TYPE_GPRS)
									||(MemCompare(CommPara.APN, APNValue, sizeof(CommPara.APN)) != 0))
								{
									pTSysCtrl->Flag |= TERMINAL_COMM_PARA_CHANGE_FLAG;
								}
								MR((u32)&CommPara.MasterAddr,(u32)IPPORT,sizeof(IPPORT));                //主用IP地址、端口
								CommPara.MasterAddrType = MASTER_CH_TYPE_GPRS;            //主用通道类型
								MR((u32)&CommPara.MasterBackAddr1,(u32)IPPORT,sizeof(IPPORT));           //备用IP1地址、端口
								CommPara.MasterBackAddr1Type = MASTER_CH_TYPE_GPRS;       //备用IP1通道类型
								MR((u32)&CommPara.MasterBackAddr2,(u32)IPPORT,sizeof(IPPORT));           //备用IP2地址、端口
								CommPara.MasterBackAddr2Type = MASTER_CH_TYPE_GPRS;       //备用IP2通道类型
								MR((u32)&CommPara.APN,(u32)APNValue,sizeof(APNValue));                     //APN
								MW((u32)&CommPara,ADDR_CommunicationPara,sizeof(CommunicationParaStruct));
								
								DisplayString(4,0,0,"         OK         ");	
								break;
							default:
								break;
						}						
						Comm_Ram->ButtonVal&=~0x1F;//键使用后清0
					}
					else
					{
						Comm_Ram->ButtonVal&=~0x0F;//键使用后清0
						break;
					}
				}
			}
			if((Comm_Ram->ButtonVal&0x20)!=0)
			{//返回
				MenuDel();//返回上级菜单
			}
			Comm_Ram->ButtonVal&=~0x20;//键使用后清0
			break;
		default:
			break;
	}
}



//-------------------------------------------------------------------------------------------------
// Function name:       Menu_7_1_7_1_1_3
// Descriptions:        普通卡电信
// input parameters:    无
// output parameters:   无
// Returned value:      无
//-------------------------------------------------------------------------------------------------
void Menu_7_1_7_1_1_3(void)// 普通卡电信
{

/*
//	u8 IPPORT[6] = {0x21,0x1C,0x47,0x01,0x64,0xAC};
//	u8 APNValue[16] = {'Y','E','P','G','F','K','.','V','P','D','N','.','Y','N'};
//	u8 USERNAMEValue[32] = {'q','j','d','w','@','y','n','d','w','s','k','.','v','p','d','n','.','y','n'};
//	u8 PASSWORDValue[32] = {'g','d','j','1','7','2'};
	u32 j = 0;	
//	CommunicationParaStruct CommPara;
//	TerminalRunTimeCtrlStruct* pTSysCtrl = (TerminalRunTimeCtrlStruct*)ADDR_Terminal_RunTime;
	
	switch(Stack->MenuStack[MenuCount->Count].Task)//菜单任务计数
	{
		case 0://任务0:初始化
			Stack->MenuStack[MenuCount->Count].Task=1;
			DisplayClr();//清全屏
			MenuCount->v1=0;
			MenuCount->v2=0;
			MenuCount->v3=0;
			DisplayMenu(Stack->MenuStack[MenuCount->Count].MoveRow,(u8 *)pMenu_7_1_7_1_1_2);//显示菜单	
//			DisplayString(1,6,0,"172.100.1.71");      //IP地址
//			DisplayString(2,6,0,"7201");						    //端口号		
//			DisplayString(3,6,0,"YEPGFK.VPDN.YN");						//APN		
//			DisplayString(4,7,7,"qjdw@yndwsk.vpdn.yn");						//用户名
//			DisplayString(6,7,0,"gdj172");										//密码			
//			DisplayString(7,0,0,"      确认设置\n\r");
			MenuCount->v1=7;
			MenuCount->v2=19;
			NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
			break;
		case 2:
			if((Comm_Ram->ButtonVal&0x20)!=0)
			{//返回
				Stack->MenuStack[MenuCount->Count].Task = 0;
				Stack->MenuStack[MenuCount->Count].MoveRow = 0;
				Stack->MenuStack[MenuCount->Count].EditRow = 1;
				Comm_Ram->ButtonVal&=~0x20;
			}
			break;
		case 1://任务1:选择
			for(j=0;j<2;j++)
			{
				if(Stack->MenuStack[MenuCount->Count].EditCol==0)
				{
					BoxSelect();
					switch(Stack->MenuStack[MenuCount->Count].EditRow+Stack->MenuStack[MenuCount->Count].MoveRow)
					{
						case 1:
							MenuCount->v1=7;
							MenuCount->v2=19;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 2:
							MenuCount->v1=7;
							MenuCount->v2=19;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 3:
							MenuCount->v1=7;
							MenuCount->v2=19;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 4:
							MenuCount->v1=7;
							MenuCount->v2=19;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 5:
							MenuCount->v1=7;
							MenuCount->v2=19;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 6:
							MenuCount->v1=7;
							MenuCount->v2=19;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 7:
							MenuCount->v1=0;
							MenuNegative(Stack->MenuStack[MenuCount->Count].EditRow);
							break;
						default:
							break;
					}
					if((Comm_Ram->ButtonVal&0x10)!=0)
					{//确认						
						switch(Stack->MenuStack[MenuCount->Count].EditRow+Stack->MenuStack[MenuCount->Count].MoveRow)
						{
							case 1:
								Stack->MenuStack[MenuCount->Count].EditCol=MenuCount->v1;
								break;
							case 2:
							case 3:
							case 4:
							case 5:	
							case 6:
								break;
							case 7:
								//保存设置的数据
//								MR((u32)&CommPara,ADDR_CommunicationPara,sizeof(CommunicationParaStruct));
//								MR((u32)&p1SelfAdaptionPara,ADDR_SelfAdaptionPara,sizeof(SelfAdaptionParaStruct));	
//									if((MemCompare(CommPara.MasterAddr, IPPORT, 6) != 0) 
//										||(CommPara.MasterAddrType != MASTER_CH_TYPE_GPRS)
//										||(MemCompare(CommPara.MasterBackAddr1, IPPORT, 6) != 0) 
//										||(CommPara.MasterBackAddr1Type != MASTER_CH_TYPE_GPRS)
//										||(MemCompare(CommPara.MasterBackAddr2, IPPORT, 6) != 0) 
//										||(CommPara.MasterBackAddr2Type != MASTER_CH_TYPE_GPRS)
//										||(MemCompare(CommPara.APN, APNValue, sizeof(CommPara.APN)) != 0)
//										||(MemCompare(CommPara.APNUserName, USERNAMEValue, sizeof(CommPara.APNUserName)) != 0)
//										||(MemCompare(CommPara.APNPassWord, PASSWORDValue, sizeof(CommPara.APNPassWord)) != 0))
//									{
//										pTSysCtrl->Flag |= TERMINAL_COMM_PARA_CHANGE_FLAG;
//									}
//									MR((u32)&CommPara.MasterAddr,(u32)IPPORT,sizeof(IPPORT));                //主用IP地址、端口
//									CommPara.MasterAddrType = MASTER_CH_TYPE_GPRS;            //主用通道类型
//									MR((u32)&CommPara.MasterBackAddr1,(u32)IPPORT,sizeof(IPPORT));           //备用IP1地址、端口
//									CommPara.MasterBackAddr1Type = MASTER_CH_TYPE_GPRS;       //备用IP1通道类型
//									MR((u32)&CommPara.MasterBackAddr2,(u32)IPPORT,sizeof(IPPORT));           //备用IP2地址、端口
//									CommPara.MasterBackAddr2Type = MASTER_CH_TYPE_GPRS;       //备用IP2通道类型
//									MR((u32)&CommPara.APN,(u32)APNValue,sizeof(APNValue));                     //APN
//									MR((u32)&CommPara.APNUserName,(u32)USERNAMEValue,sizeof(USERNAMEValue));        //APN用户名
//									MR((u32)&CommPara.APNPassWord,(u32)PASSWORDValue,sizeof(PASSWORDValue));         //APN密码
//									MW((u32)&CommPara,ADDR_CommunicationPara,sizeof(CommunicationParaStruct));
//									
//									DisplayString(7,0,0,"         OK         ");	
								break;
							default:
								break;
						}						
						Comm_Ram->ButtonVal&=~0x1F;//键使用后清0
					}
					else
					{
						Comm_Ram->ButtonVal&=~0x0F;//键使用后清0
						break;
					}
				}
			}
			if((Comm_Ram->ButtonVal&0x20)!=0)
			{//返回
				MenuDel();//返回上级菜单
			}
			Comm_Ram->ButtonVal&=~0x20;//键使用后清0
			break;
		default:
			break;
	}
*/

	if((Comm_Ram->ButtonVal&0x2F)!=0)
	{//返回
		MenuDel();//返回上级菜单
	}
	Comm_Ram->ButtonVal&=~0x2F;//键使用后清0

