gdgly/NUC97X_JS/STM32F4xx/CSG/MenuCSG/Menu_7_ParametersSetting.c
u32 ConvertPnParaToBitValue(MeasurePointStruct* Pn)
{
	u32 BitValue = 0, BaudRateValue = 0, i = 0;

	if(Pn->State == 0x01) BitValue |= PN_EFFECTIVE_BIT_MASK;

	BaudRateValue = Pn->PortBaudRate;
	BaudRateValue *= 300;

	for(i = 0; i < MAX_BAUD_NUM; i++)
	{
		if(UartBaudRate[i] == BaudRateValue) break;
	}
	if(i >= MAX_BAUD_NUM) i = BAUD_RATE_1200_ID;
	
	BitValue |= i << 1;

	if((Pn->PortID == PORT_ID_RS485_1))
	{
		BitValue |= PORT_ID_RS485_1 << 5;
	}
	else if(Pn->PortID == PORT_ID_RS485_2)
	{
		BitValue |= PORT_ID_RS485_2 << 5;
	}
	else if(Pn->PortID == PORT_ID_RS485_3)
	{
		BitValue |= PORT_ID_RS485_3 << 5;
	}
	else if(Pn->PortID == PORT_ID_PLC)
	{
		BitValue |= (PORT_ID_RS485_3 + 1) << 5;
	}
	else// if(Pn->PortID == PORT_ID_WIRELESS)
	{
		BitValue |= (PORT_ID_RS485_3 + 2) << 5;
	}


	if(Pn->ProtocolType == 0)		// 97规约
	{
		BitValue |= 0 << 8;
	}
	else if(Pn->ProtocolType == 1)	// 07规约
	{
		BitValue |= 1 << 8;
	}
	else //if(Pn->ProtocolType == 0x07)	// EDMI规约
	{
		BitValue |= 2 << 8;
	}
//	else
//	{
//		BitValue |= PN_PROTOCOL_BIT_MASK;
//	}


	if(Pn->PointMeterType == METER_TYPE_SINGLE)
	{
		BitValue |= METER_TYPE_SINGLE << 12;
	}
	else if(Pn->PointMeterType == METER_TYPE_MULTI)
	{
		BitValue |= METER_TYPE_MULTI << 12;
	}
	else
	{
		BitValue |= METER_TYPE_OTHER << 12;
	}

	if(Pn->TotalType == 0)
	{
		BitValue |= 0 << 15;
	}
	else
	{
		BitValue |= 1 << 15;
	}

	if(Pn->PriorityType == 0)
	{
		BitValue |= 0 << 17;
	}
	else
	{
		BitValue |= 1 << 17;
	}

	if(Pn->SwitchOff == 0)
	{
		BitValue |= 0 << 18;
	}
	else
	{
		BitValue |= 1 << 18;
	}

	return BitValue;
}

void ConvertBitValueToPnPara(MeasurePointStruct* Pn, u32 BitValue)
{
	u32 i = 0;

	if((BitValue & PN_EFFECTIVE_BIT_MASK) != 0)
	{
		Pn->State = 0x01;
	}
	else
	{
		Pn->State = 0x00;
	}

	i = (BitValue & PN_BAUD_RATE_BIT_MASK) >> 1;
	if(i >= MAX_BAUD_NUM)  i = BAUD_RATE_1200_ID;
	Pn->PortBaudRate = UartBaudRate[i]/300;

	i = (BitValue & PN_PORT_ID_BIT_MASK) >> 5;

	if(i == PORT_ID_RS485_1)
	{
		Pn->PortID = PORT_ID_RS485_1;
	}
	else if(i == PORT_ID_RS485_2)
	{
		Pn->PortID = PORT_ID_RS485_2;
	}
	else if(i == PORT_ID_RS485_3)
	{
		Pn->PortID = PORT_ID_RS485_3;
	}
	else if(i == (PORT_ID_RS485_3 + 1))
	{
		Pn->PortID = PORT_ID_PLC;
	}
	else// if(i == PORT_ID_WIRELESS)
	{
		Pn->PortID = PORT_ID_WIRELESS;
	}

	i = (BitValue & PN_PROTOCOL_BIT_MASK) >> 8;
	//Pn->ProtocolType = i;
	if(i == METER_DLT645_97)
	{
		Pn->ProtocolType = METER_DLT645_97;
	}
	else if(i == METER_DLT645_07)
	{
		Pn->ProtocolType = METER_DLT645_07;
	}
	else// if(i == METER_EDMI)
	{
		Pn->ProtocolType = METER_EDMI;
	}

	

	i = (BitValue & PN_METER_TYPE_BIT_MASK) >> 12;
	Pn->PointMeterType = i;

	i = (BitValue & PN_TOTAL_TYPE_BIT_MASK) >> 15;
	Pn->TotalType = i;

	i = (BitValue & PN_USER_TYPE_BIT_MASK) >> 17;
	Pn->PriorityType = i;

	i = (BitValue & PN_ON_OFF_BIT_MASK) >> 18;
	Pn->SwitchOff = i;	
}


#if Project == 200
//-------------------------------------------------------------------------------------------------
// Function name:       Menu_7_2_1
// Descriptions:        设置测量点
// input parameters:    无
// output parameters:   无
// Returned value:      无
//-------------------------------------------------------------------------------------------------
void Menu_7_2_1(void)//设置测量点参数
{
	u8 *p8;
	u16 *p16;
	u32 Pn,Ret;
	u64 x;
	MeasurePointStruct MeasurePoint;
	u32 PnNum = 0, FlashAddr = 0;
	u32 i = 0, j = 0, EditRow = 0;	//菜单从第0行开始	
	MeterFileInfoStruct* MeterFileInfo = (MeterFileInfoStruct*)ADDR_MeterFileInfo;
	Terminal_Ram_TypeDef* pTerminalRam = Terminal_Ram;
	MenuCount_TypeDef* pMenuCount = MenuCount;
	StrBuff_TypeDef* DispBuf = StrBuff;
	StrBuff_TypeDef* BackDispBuf = StrBuff2;

	
	switch(Stack->MenuStack[MenuCount->Count].Task)//菜单任务计数
	{
		case 0://任务0:初始化
			Stack->MenuStack[MenuCount->Count].Task=1;
			DisplayClr();//清全屏
			MenuCount->v1=0;
			MenuCount->v2=0;
			MenuCount->v3=0;
			DisplayMenu_CSG(Stack->MenuStack[MenuCount->Count].MoveRow,(u8 *)pJZQMenu_7_2_1);//显示菜单	
			DisplayString(1,8,0,"0000");
			DisplayString(2,8,0,"无效");																		//有效位		
			DisplayString(3,8,0,"1200");																		//通信速率					
			DisplayString(4,8,0,"RS485_1");																	//端口号				
			DisplayString(5,8,0,"  07协议");																	//协议类型
			DisplayString(6,8,0,"000000000000");
			DisplayString(7,8,0,"000000000000");
			DisplayString(8,8,0,"  单相表");			//电能表类型							
			DisplayStringOutoffScreenLine(10,0,0,"总分类型  用户表");				//总分类型											
			DisplayStringOutoffScreenLine(11,0,0,"重点户  普通用户");				//重点户属性								
			DisplayStringOutoffScreenLine(12,0,0,"拉闸功能不带拉闸");				//拉闸功能
			MC(0, (u32)&DispBuf->Row[13], sizeof(StrLnBuff_TypeDef));
			DisplayStringOutoffScreenLine(13,0,0,"费率数  04");
			DisplayStringOutoffScreenLine(14,0,0,"CT变比  0000");
			DisplayStringOutoffScreenLine(15,0,0,"PT变比  0000");
			//DisplayStringOutoffScreenLine(15,0,0,"      确认设置\n\r");
			pMenuCount->v3 = 0x00001104;
			MenuCount->v1=8;
			MenuCount->v2=11;
			NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
			break;
		case 2:
			if((Comm_Ram->ButtonVal&0x20)!=0)
			{//返回
				Stack->MenuStack[MenuCount->Count].Task = 0;
				Stack->MenuStack[MenuCount->Count].MoveRow = 0;
				Stack->MenuStack[MenuCount->Count].EditRow = 1;
				Comm_Ram->ButtonVal&=~0x20;
			}
			break;
		case 1://任务1:选择
			for(j=0;j<2;j++)
			{
				if(Stack->MenuStack[MenuCount->Count].EditCol==0)
				{
					BoxSelectOutofScreenLine();
					switch(Stack->MenuStack[MenuCount->Count].EditRow+Stack->MenuStack[MenuCount->Count].MoveRow)
					{
						case 1:
							MenuCount->v1=8;
							MenuCount->v2=11;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 2:
							MenuCount->v1=8;
							MenuCount->v2=11;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 3:
							MenuCount->v1=8;
							MenuCount->v2=11;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 4:
							MenuCount->v1=8;
							MenuCount->v2=14;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 5:
							MenuCount->v1=8;
							MenuCount->v2=15;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 6:
							MenuCount->v1=8;
							MenuCount->v2=19;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 7:
							MenuCount->v1=8;
							MenuCount->v2=19;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 8:
							MenuCount->v1=8;
							MenuCount->v2=15;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 9:
							MenuCount->v1=8;
							MenuCount->v2=15;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 10:
							MenuCount->v1=8;
							MenuCount->v2=15;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 11:
							MenuCount->v1=8;
							MenuCount->v2=15;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 12:
							MenuCount->v1=8;
							MenuCount->v2=9;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 13:
							MenuCount->v1=8;
							MenuCount->v2=11;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 14:
							MenuCount->v1=8;
							MenuCount->v2=11;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);				
							break;
						case 15:
							MenuCount->v1=0;
							MenuNegative(Stack->MenuStack[MenuCount->Count].EditRow);
							DisplayStringOutoffScreenLine(8,0,0,"      确认设置      ");
							break;
						default:
							break;
					}
					if((Comm_Ram->ButtonVal&0x08)!=0)
					{//右键
						EditRow = Stack->MenuStack[MenuCount->Count].EditRow;
						switch(Stack->MenuStack[MenuCount->Count].EditRow+Stack->MenuStack[MenuCount->Count].MoveRow)
						{							
							case 2:		
								x = pMenuCount->v3 & PN_EFFECTIVE_BIT_MASK;
								if(x == 0)
								{
									pMenuCount->v3 |= PN_EFFECTIVE_BIT_MASK;
									DisplayString(EditRow,8,0,"有效");
								}
								else
								{
									pMenuCount->v3 &= ~PN_EFFECTIVE_BIT_MASK;
									DisplayString(EditRow,8,0,"无效");
								}
								break;
							case 3:		
								x = pMenuCount->v3 & PN_BAUD_RATE_BIT_MASK;
								x >>= 1;
								x++;
								if(x > BAUD_RATE_9600_ID) x = BAUD_RATE_1200_ID;
								switch(x)
								{
									case BAUD_RATE_1200_ID:
										DisplayString(EditRow,8,0,"1200");
										pMenuCount->v3 &= ~PN_BAUD_RATE_BIT_MASK;
										pMenuCount->v3 |= BAUD_RATE_1200_ID << 1;
										break;
									case BAUD_RATE_2400_ID:
										DisplayString(EditRow,8,0,"2400");
										pMenuCount->v3 &= ~PN_BAUD_RATE_BIT_MASK;
										pMenuCount->v3 |= BAUD_RATE_2400_ID << 1;
										break;
									case BAUD_RATE_4800_ID:
										DisplayString(EditRow,8,0,"4800");
										pMenuCount->v3 &= ~PN_BAUD_RATE_BIT_MASK;
										pMenuCount->v3 |= BAUD_RATE_4800_ID << 1;
										break;
									case BAUD_RATE_9600_ID:
									default:
										DisplayString(EditRow,8,0,"9600");
										pMenuCount->v3 &= ~PN_BAUD_RATE_BIT_MASK;
										pMenuCount->v3 |= BAUD_RATE_9600_ID << 1;
										break;
								}
								break;
							case 4:		
								x = pMenuCount->v3 & PN_PORT_ID_BIT_MASK;
								x >>= 5;
								x++;
								if(x > (PORT_ID_RS485_3 + 2)) x = PORT_ID_RS485_1;
								switch(x)
								{
									case PORT_ID_RS485_1:
										DisplayString(EditRow,8,0,"RS485_1");				//端口号
										pMenuCount->v3 &= ~PN_PORT_ID_BIT_MASK;
										pMenuCount->v3 |= PORT_ID_RS485_1 << 5;
										break;
									case PORT_ID_RS485_2:
										DisplayString(EditRow,8,0,"RS485_2");				//端口号
										pMenuCount->v3 &= ~PN_PORT_ID_BIT_MASK;
										pMenuCount->v3 |= PORT_ID_RS485_2 << 5;
										break;
									case PORT_ID_RS485_3:
										DisplayString(EditRow,8,0,"RS485_3");				//端口号
										pMenuCount->v3 &= ~PN_PORT_ID_BIT_MASK;
										pMenuCount->v3 |= PORT_ID_RS485_3 << 5;
										break;
									case (PORT_ID_RS485_3 + 1):
										DisplayString(EditRow,8,0,"   载波");				//端口号
										pMenuCount->v3 &= ~PN_PORT_ID_BIT_MASK;
										pMenuCount->v3 |= (PORT_ID_RS485_3 + 1) << 5;
										break;
									case (PORT_ID_RS485_3 + 2):
									default:
										DisplayString(EditRow,8,0,"   无线");				//端口号
										pMenuCount->v3 &= ~PN_PORT_ID_BIT_MASK;
										pMenuCount->v3 |= (PORT_ID_RS485_3 + 2) << 5;
										break;
								}
								break;
							case 5:	
								x = pMenuCount->v3 & PN_PROTOCOL_BIT_MASK;
								x >>= 8;
								x++;
								if(x > (METER_DLT645_07 + 1) ) x = METER_DLT645_97;
								switch(x)
								{
									case METER_DLT645_97:
										pMenuCount->v3 &= ~PN_PROTOCOL_BIT_MASK;
										pMenuCount->v3 |= 0 << 8;
										DisplayString(EditRow,8,0,"  97协议");				//协议类型
										break;
									case METER_DLT645_07:
										pMenuCount->v3 &= ~PN_PROTOCOL_BIT_MASK;
										pMenuCount->v3 |= 1 << 8;
										DisplayString(EditRow,8,0,"  07协议");				//协议类型
										break;
									case (METER_DLT645_07 + 1):
										pMenuCount->v3 &= ~PN_PROTOCOL_BIT_MASK;
										pMenuCount->v3 |= 2 << 8;
										DisplayString(EditRow,8,0,"EDMI协议");				//协议类型
										break;
								}
								break;
							case 8:		
								x = pMenuCount->v3 & PN_METER_TYPE_BIT_MASK;
								x >>= 12;
								x++;
								if(x > METER_TYPE_OTHER) x = METER_TYPE_SINGLE;
								switch(x)
								{
									case METER_TYPE_SINGLE:
										DisplayString(EditRow,8,0,"  单相表");				//电能表类型
										pMenuCount->v3 &= ~PN_METER_TYPE_BIT_MASK;
										pMenuCount->v3 |= METER_TYPE_SINGLE << 12;
										break;
									case METER_TYPE_MULTI:
										DisplayString(EditRow,8,0,"多功能表");			//电能表类型
										pMenuCount->v3 &= ~PN_METER_TYPE_BIT_MASK;
										pMenuCount->v3 |= METER_TYPE_MULTI << 12;
										break;
									case METER_TYPE_OTHER:
									default:
										DisplayString(EditRow,8,0,"  其它表");				//电能表类型
										pMenuCount->v3 &= ~PN_METER_TYPE_BIT_MASK;
										pMenuCount->v3 |= METER_TYPE_OTHER << 12;
										break;
								}
								break;
							case 9:
								x = pMenuCount->v3 & PN_TOTAL_TYPE_BIT_MASK;
								x >>= 15;
								if(x == 0)
								{
									pMenuCount->v3 &= ~PN_TOTAL_TYPE_BIT_MASK;
									pMenuCount->v3 |= 1 << 15;
									DisplayStringOutoffScreenLine(EditRow,8,0,"    总表");			//总分类型	
								}
								else
								{
									pMenuCount->v3 &= ~PN_TOTAL_TYPE_BIT_MASK;
									pMenuCount->v3 |= 0 << 15;
									DisplayStringOutoffScreenLine(EditRow,8,0,"  用户表");			//总分类型								
								}
								break;
							case 10:
								x = pMenuCount->v3 & PN_USER_TYPE_BIT_MASK;
								if(x == 0)
								{
									pMenuCount->v3 |= PN_USER_TYPE_BIT_MASK;
									DisplayStringOutoffScreenLine(EditRow,8,0,"重点用户");			
								}
								else
								{
									pMenuCount->v3 &= ~PN_USER_TYPE_BIT_MASK;
									DisplayStringOutoffScreenLine(EditRow,8,0,"普通用户");									
								}
								break;
							case 11:	
								x = pMenuCount->v3 & PN_ON_OFF_BIT_MASK;
								if(x == 0)
								{
									pMenuCount->v3 |= PN_ON_OFF_BIT_MASK;
									DisplayStringOutoffScreenLine(EditRow,8,0,"  带拉闸");									
								}
								else
								{
									pMenuCount->v3 &= ~PN_ON_OFF_BIT_MASK;
									DisplayStringOutoffScreenLine(EditRow,8,0,"不带拉闸");			
								}
								break;
							default:
								break;
						}
					}
					if((Comm_Ram->ButtonVal&0x04)!=0)
					{//左键
						EditRow = Stack->MenuStack[MenuCount->Count].EditRow;
						switch(Stack->MenuStack[MenuCount->Count].EditRow+Stack->MenuStack[MenuCount->Count].MoveRow)
						{						
							case 2:		
								x = pMenuCount->v3 & PN_EFFECTIVE_BIT_MASK;
								if(x == 0)
								{
									pMenuCount->v3 |= PN_EFFECTIVE_BIT_MASK;
									DisplayString(EditRow,8,0,"有效");
								}
								else
								{
									pMenuCount->v3 &= ~PN_EFFECTIVE_BIT_MASK;
									DisplayString(EditRow,8,0,"无效");
								}
								break;
							case 3:		
								x = pMenuCount->v3 & PN_BAUD_RATE_BIT_MASK;
								x >>= 1;
								if(x == 0)
								{
									x = BAUD_RATE_9600_ID;
								}
								else
								{
									x--;
									if(x == BAUD_RATE_7200_ID) x = BAUD_RATE_4800_ID;
								}
								switch(x)
								{
									case BAUD_RATE_1200_ID:
										DisplayString(EditRow,8,0,"1200");
										pMenuCount->v3 &= ~PN_BAUD_RATE_BIT_MASK;
										pMenuCount->v3 |= BAUD_RATE_1200_ID << 1;
										break;
									case BAUD_RATE_2400_ID:
										DisplayString(EditRow,8,0,"2400");
										pMenuCount->v3 &= ~PN_BAUD_RATE_BIT_MASK;
										pMenuCount->v3 |= BAUD_RATE_2400_ID << 1;
										break;
									case BAUD_RATE_4800_ID:
										DisplayString(EditRow,8,0,"4800");
										pMenuCount->v3 &= ~PN_BAUD_RATE_BIT_MASK;
										pMenuCount->v3 |= BAUD_RATE_4800_ID << 1;
										break;
									case BAUD_RATE_9600_ID:
									default:
										DisplayString(EditRow,8,0,"9600");
										pMenuCount->v3 &= ~PN_BAUD_RATE_BIT_MASK;
										pMenuCount->v3 |= BAUD_RATE_9600_ID << 1;
										break;
								}
								break;
							case 4:		
								x = pMenuCount->v3 & PN_PORT_ID_BIT_MASK;
								x >>= 5;
								if(x <= PORT_ID_RS485_1)
								{
									x = PORT_ID_RS485_3 + 2;
								}
								else
								{
									x--;
								}
								switch(x)
								{
									case PORT_ID_RS485_1:
										DisplayString(EditRow,8,0,"RS485_1");				//端口号
										pMenuCount->v3 &= ~PN_PORT_ID_BIT_MASK;
										pMenuCount->v3 |= PORT_ID_RS485_1 << 5;
										break;
									case PORT_ID_RS485_2:
										DisplayString(EditRow,8,0,"RS485_2");				//端口号
										pMenuCount->v3 &= ~PN_PORT_ID_BIT_MASK;
										pMenuCount->v3 |= PORT_ID_RS485_2 << 5;
										break;
									case PORT_ID_RS485_3:
										DisplayString(EditRow,8,0,"RS485_3");				//端口号
										pMenuCount->v3 &= ~PN_PORT_ID_BIT_MASK;
										pMenuCount->v3 |= PORT_ID_RS485_3 << 5;
										break;
									case (PORT_ID_RS485_3 + 1):
										DisplayString(EditRow,8,0,"   载波");				//端口号
										pMenuCount->v3 &= ~PN_PORT_ID_BIT_MASK;
										pMenuCount->v3 |= (PORT_ID_RS485_3 + 1) << 5;
										break;
									case (PORT_ID_RS485_3 + 2):
									default:
										DisplayString(EditRow,8,0,"   无线");				//端口号
										pMenuCount->v3 &= ~PN_PORT_ID_BIT_MASK;
										pMenuCount->v3 |= (PORT_ID_RS485_3 + 2) << 5;
										break;
								}
								break;
							case 5:	
								x = pMenuCount->v3 & PN_PROTOCOL_BIT_MASK;
								x >>= 8;
								if(x <= METER_DLT645_97)
								{
									x = (METER_DLT645_07 + 1);
								}
								else
								{
									x--;
								}
								switch(x)
								{
									case METER_DLT645_97:
										pMenuCount->v3 &= ~PN_PROTOCOL_BIT_MASK;
										pMenuCount->v3 |= 0 << 8;
										DisplayString(EditRow,8,0,"  97协议");				//协议类型
										break;
									case METER_DLT645_07:
										pMenuCount->v3 &= ~PN_PROTOCOL_BIT_MASK;
										pMenuCount->v3 |= 1 << 8;
										DisplayString(EditRow,8,0,"  07协议");				//协议类型
										break;
									case (METER_DLT645_07 + 1):
										pMenuCount->v3 &= ~PN_PROTOCOL_BIT_MASK;
										pMenuCount->v3 |= 2 << 8;
										DisplayString(EditRow,8,0,"EDMI协议");				//协议类型
										break;
								}
								break;
							case 8:		
								x = pMenuCount->v3 & PN_METER_TYPE_BIT_MASK;
								x >>= 12;
								if(x <= METER_TYPE_SINGLE)
								{
									x = METER_TYPE_OTHER;
								}
								else
								{
									x--;
								}
								switch(x)
								{
									case METER_TYPE_SINGLE:
										DisplayString(EditRow,8,0,"  单相表");				//电能表类型
										pMenuCount->v3 &= ~PN_METER_TYPE_BIT_MASK;
										pMenuCount->v3 |= METER_TYPE_SINGLE << 12;
										break;
									case METER_TYPE_MULTI:
										DisplayString(EditRow,8,0,"多功能表");			//电能表类型
										pMenuCount->v3 &= ~PN_METER_TYPE_BIT_MASK;
										pMenuCount->v3 |= METER_TYPE_MULTI << 12;
										break;
									case METER_TYPE_OTHER:
									default:
										DisplayString(EditRow,8,0,"  其它表");				//电能表类型
										pMenuCount->v3 &= ~PN_METER_TYPE_BIT_MASK;
										pMenuCount->v3 |= METER_TYPE_OTHER << 12;
										break;
								}
								break;
							case 9:
								x = pMenuCount->v3 & PN_TOTAL_TYPE_BIT_MASK;
								x >>= 15;
								if(x == 0)
								{
									pMenuCount->v3 &= ~PN_TOTAL_TYPE_BIT_MASK;
									pMenuCount->v3 |= 1 << 15;
									DisplayStringOutoffScreenLine(EditRow,8,0,"    总表");			//总分类型	
								}
								else
								{
									pMenuCount->v3 &= ~PN_TOTAL_TYPE_BIT_MASK;
									pMenuCount->v3 |= 0 << 15;
									DisplayStringOutoffScreenLine(EditRow,8,0,"  用户表");			//总分类型								
								}
								break;
							case 10:
								x = pMenuCount->v3 & PN_USER_TYPE_BIT_MASK;
								if(x == 0)
								{
									pMenuCount->v3 |= PN_USER_TYPE_BIT_MASK;
									DisplayStringOutoffScreenLine(EditRow,8,0,"重点用户");			
								}
								else
								{
									pMenuCount->v3 &= ~PN_USER_TYPE_BIT_MASK;
									DisplayStringOutoffScreenLine(EditRow,8,0,"普通用户");									
								}
								break;
							case 11:	
								x = pMenuCount->v3 & PN_ON_OFF_BIT_MASK;
								if(x == 0)
								{
									pMenuCount->v3 |= PN_ON_OFF_BIT_MASK;
									DisplayStringOutoffScreenLine(EditRow,8,0,"  带拉闸");												
								}
								else
								{
									pMenuCount->v3 &= ~PN_ON_OFF_BIT_MASK;
									DisplayStringOutoffScreenLine(EditRow,8,0,"不带拉闸");
								}
								break;
							default:
								break;
						}
					}
					if((Comm_Ram->ButtonVal&0x10)!=0)
					{//确认						
						switch(Stack->MenuStack[MenuCount->Count].EditRow+Stack->MenuStack[MenuCount->Count].MoveRow)
						{
							case 1:
							case 6:
							case 7:
							case 12:
							case 13:
							case 14:
								Stack->MenuStack[MenuCount->Count].EditCol=MenuCount->v1;
								break;
							case 2:
							case 3:
							case 4:
							case 5:					
							case 8:
							case 9:
							case 10:
							case 11:						
								break;
							case 15:
								//保存设置的数据
								Stack->MenuStack[MenuCount->Count].Task = 2;
								j = 2;									// 跳出最外层 for 循环
								p8 = (u8*)&BackDispBuf->Row[0].Col[8];
								PnNum = p8_bcd(p8,4);
								if(PnNum > MAX_PN_NUM)
								{//测量点超过最大值 则不可设置
									DisplayString(8,0,0,"错误:测量点号 > 1023");
								}
								else
								{	
									FlashAddr = ADDR_MP_START + PnNum * (sizeof(MeasurePointStruct) + sizeof(PowerQualityParaStruct));
									MR((u32)&MeasurePoint, FlashAddr, sizeof(MeasurePointStruct));
									ConvertBitValueToPnPara(&MeasurePoint, pMenuCount->v3);
									
									for(i = 0; i < METER_ADDR_SIZE; i++)
									{	// 采集器地址显示缓冲，位于备份缓冲区
										MeasurePoint.CollectorAddr[METER_ADDR_SIZE-1 - i] = CharToHex(BackDispBuf->Row[6].Col[8 + i*2]);
										MeasurePoint.CollectorAddr[METER_ADDR_SIZE-1 - i] <<= 4;
										MeasurePoint.CollectorAddr[METER_ADDR_SIZE-1 - i] |= CharToHex(BackDispBuf->Row[6].Col[8 + i*2 +1]);
									}

									for(i = 0; i < METER_ADDR_SIZE; i++)
									{	// 电能表地址显示缓冲，位于备份缓冲区
										MeasurePoint.Addr[METER_ADDR_SIZE-1 - i] = CharToHex(BackDispBuf->Row[5].Col[8 + i*2]);
										MeasurePoint.Addr[METER_ADDR_SIZE-1 - i] <<= 4;
										MeasurePoint.Addr[METER_ADDR_SIZE-1 - i] |= CharToHex(BackDispBuf->Row[5].Col[8 + i*2 +1]);
									}

									i = CharToHex(DispBuf->Row[5].Col[8]) << 4;
									i += CharToHex(DispBuf->Row[5].Col[9]);
									MeasurePoint.MaxRateNum = i;

									i = CharToHex(DispBuf->Row[6].Col[8]) << 12;
									i += CharToHex(DispBuf->Row[6].Col[9]) << 8;
									i += CharToHex(DispBuf->Row[6].Col[10]) << 4;
									i += CharToHex(DispBuf->Row[6].Col[11]);
									MeasurePoint.CT = i;

									i = CharToHex(DispBuf->Row[7].Col[8]) << 12;
									i += CharToHex(DispBuf->Row[7].Col[9]) << 8;
									i += CharToHex(DispBuf->Row[7].Col[10]) << 4;
									i += CharToHex(DispBuf->Row[7].Col[11]);
									MeasurePoint.PT = i;
									
									Pn=SwitchNumToPn(PnNum);                                     //判断表地址是否重复
									Ret=QCSG_CheckPnAddrIsDuplicate(Pn,MeasurePoint.Addr);
									if(Ret==ERROR_InvalidData)
									{
										DisplayString(8,0,0,"  错误:表地址重复   ");		
									}
									else
									{
										MeasurePoint.PortParity  = 1;                //ybzyl默认设置测量点校验方式为偶校验、数据位为8位，停止位为1位
										MeasurePoint.PortDataBit = 8;                
										MeasurePoint.PortStopBit = 0;
																		
