gdgly/NUC97X_JS/STM32F4xx/CSG/MenuCSG/Menu_7_ParametersSetting.c
										MW((u32)&MeasurePoint, FlashAddr, sizeof(MeasurePointStruct));
										DisplayString(8,0,0,"         OK         ");
										
										if(Pn == 0)//err20190605 菜单设置测量点0地址，同步到交采。
										{
											SetACSampleAddr(MeasurePoint.Addr);
										}

										MeterFileInfo->CountFlag = METER_FILE_SYNC_TO_RAM_FLAG;
										pTerminalRam->MeterSyncToRam_S_Timer = METER_FILE_SYNC_DELAY_TIME;
									}
								}								
								break;
							default:
								break;
						}						
						Comm_Ram->ButtonVal&=~0x1F;//键使用后清0
					}
					else
					{
						Comm_Ram->ButtonVal&=~0x0F;//键使用后清0
						break;
					}
				}
				else //if(Stack->MenuStack[MenuCount->Count].EditCol!=0)
				{
					Select(MenuCount->v2,MenuCount->v1);
					UpDownSelect();
					if((Comm_Ram->ButtonVal&0x10)!=0)
					{//确认
						EditRow = Stack->MenuStack[MenuCount->Count].EditRow;
						switch(Stack->MenuStack[MenuCount->Count].EditRow+Stack->MenuStack[MenuCount->Count].MoveRow)
						{
							case 1://测量点
								p16=(u16 *)(ADDR_STRINGBUFF+EditRow*84+4+16*2);
								p16[0]=0x2020;
								p16[1]=0x2020;
								p16[2]=32;//'左右箭头'
								p16[3]=33;
								p8=(u8 *)(ADDR_STRINGBUFF+EditRow*84+4+8*2);
								x=p8_bcd(p8,4);
								if(x > MAX_PN_NUM) bcd_p8(p8,9999,4);
								break;
							case 2://有效位
								break;
							case 3://速率			
								break;
							case 4://端口
								break;
							case 5://协议
								break;
							case 6://通信地址
								p8=(u8 *)(ADDR_STRINGBUFF+EditRow*84+4+8*2);
								x=p8_bcd(p8,12);
								if(x>999999999999) bcd_p8(p8,0,12);
								break;
							case 7://采集器地址
								p8=(u8 *)(ADDR_STRINGBUFF+EditRow*84+4+8*2);
								x=p8_bcd(p8,12);
								if(x>999999999999) bcd_p8(p8,0,12);
								break;
							case 8://电能表类型
								break;
							case 9://总分类型
								break;
							case 10://重点户属性
								break;
							case 11://拉闸功能
								break;
							case 12://最大费率数
								p16=(u16 *)(ADDR_STRINGBUFF+EditRow*84+4+16*2);
								p16[0]=0x2020;
								p16[1]=0x2020;
								p16[2]=32;//'左右箭头'
								p16[3]=33;
								p8=(u8 *)(ADDR_STRINGBUFF+EditRow*84+4+8*2);
								x=p8_bcd(p8,2);
								if(x > 16) bcd_p8(p8,0,2);
								break;
							case 13://CT变比
								p16=(u16 *)(ADDR_STRINGBUFF+EditRow*84+4+16*2);
								p16[0]=0x2020;
								p16[1]=0x2020;
								p16[2]=32;//'左右箭头'
								p16[3]=33;
							case 14://PT变比
								p16=(u16 *)(ADDR_STRINGBUFF+EditRow*84+4+16*2);
								p16[0]=0x2020;
								p16[1]=0x2020;
								p16[2]=32;//'左右箭头'
								p16[3]=33;
								break;
						}
						Stack->MenuStack[MenuCount->Count].EditCol=0;
						Comm_Ram->ButtonVal&=~0x1F;//键使用后清0
					}
					else
					{
						Comm_Ram->ButtonVal&=~0x0F;//键使用后清0
						break;
					}
				}
			}
			if((Comm_Ram->ButtonVal&0x20)!=0)
			{//返回
				MenuDel();//返回上级菜单
			}
			Comm_Ram->ButtonVal&=~0x20;//键使用后清0
			break;
		default:
			break;
	}
}
#endif






//-------------------------------------------------------------------------------------------------
// Function name:       Menu_7_2_2
// Descriptions:        查询测量点 
// input parameters:    无
// output parameters:   无
// Returned value:      无
//-------------------------------------------------------------------------------------------------
void Menu_7_2_2(void)//查询测量点 
{
	u8 *p8;
	u16 *p16;
	u32 PnNum = 0, EditRow = 0, j = 0;
	u64 x;
	
	
	switch(Stack->MenuStack[MenuCount->Count].Task)//菜单任务计数
	{
		case 0://任务0:初始化
			Stack->MenuStack[MenuCount->Count].Task = 1;
			DisplayClr();//清全屏
			MenuCount->v1=0;
			MenuCount->v2=0;
			DisplayMenu_CSG(Stack->MenuStack[MenuCount->Count].MoveRow,(u8 *)pMenu_7_2_2);//显示菜单
			p8=(u8*)(ADDR_STRINGBUFF+1*84+4+8*2);
			bcd_p8(p8,0,4);		
			MenuCount->v1=8;
			MenuCount->v2=11;
			NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
			break;
		case 2://任务2:滚动屏幕查询测量点信息
			BoxSelectOutofScreenLine();
			Comm_Ram->ButtonVal &= ~0x0F;
			Stack->MenuStack[MenuCount->Count].Task = 2;
			switch(Stack->MenuStack[MenuCount->Count].EditRow+Stack->MenuStack[MenuCount->Count].MoveRow)
			{
				case 1:
					MenuCount->v1=8;
					MenuCount->v2=11;
					NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
					break;
				case 2:
					MenuCount->v1=8;
					MenuCount->v2=11;
					NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
					break;
				case 3:
					MenuCount->v1=8;
					MenuCount->v2=11;
					NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
					break;
				case 4:
					MenuCount->v1=8;
					MenuCount->v2=14;
					NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
					break;
				case 5:
					MenuCount->v1=8;
					MenuCount->v2=15;
					NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
					break;
				case 6:
					MenuCount->v1=8;
					MenuCount->v2=19;
					NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
					break;
				case 7:
					MenuCount->v1=8;
					MenuCount->v2=19;
					NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
					break;
				case 8:
					MenuCount->v1=8;
					MenuCount->v2=15;
					NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
					break;
				case 9:
					MenuCount->v1=8;
					MenuCount->v2=15;
					NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
					break;
				case 10:
					MenuCount->v1=8;
					MenuCount->v2=15;
					NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
					break;
				case 11:
					MenuCount->v1=8;
					MenuCount->v2=15;
					NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
					break;
				case 12:
					MenuCount->v1=8;
					MenuCount->v2=9;
					NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
					break;
				case 13:
					MenuCount->v1=8;
					MenuCount->v2=11;
					NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
					break;
				case 14:
					MenuCount->v1=8;
					MenuCount->v2=11;
					NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);				
					break;
				default:
					break;
			}
			if((Comm_Ram->ButtonVal&0x20)!=0)
			{//返回 
				Stack->MenuStack[MenuCount->Count].Task = 0;
				Stack->MenuStack[MenuCount->Count].MoveRow = 0;
				Stack->MenuStack[MenuCount->Count].EditRow = 1;
				Comm_Ram->ButtonVal&=~0x20;//键使用后清0
			}			
			break;
		case 1://任务1:选择查询的测量点
			for(j=0;j<2;j++)
			{
				if(Stack->MenuStack[MenuCount->Count].EditCol==0)
				{
					BoxSelectOutofScreenLine();
					EditRow = Stack->MenuStack[MenuCount->Count].EditRow;
					switch(Stack->MenuStack[MenuCount->Count].EditRow)
					{
						case 1:
							MenuCount->v1=8;
							MenuCount->v2=11;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 2:
							MenuCount->v1=0;
							MenuNegative(Stack->MenuStack[MenuCount->Count].EditRow);
							break;
						default:
							break;
					}					
					if((Comm_Ram->ButtonVal&0x10)!=0)
					{//确认
						switch(Stack->MenuStack[MenuCount->Count].EditRow)
						{
							case 1:
								Stack->MenuStack[MenuCount->Count].EditCol=MenuCount->v1;
								p16=(u16 *)(ADDR_STRINGBUFF+EditRow*84+4+16*2);
								p16[0]=0x2020;
								p16[1]=0x2020;
								p16[2]=32;//'左右箭头'
								p16[3]=33;
								break;
							case 2:
								p8=(u8*)(ADDR_STRINGBUFF+1*84+4+8*2);
								x=p8_bcd(p8,4);
								PnNum=(u32)x;
								DisplayMPInformation(PnNum);
								Stack->MenuStack[MenuCount->Count].Task = 2;
								Stack->MenuStack[MenuCount->Count].EditRow = 1;
								Stack->MenuStack[MenuCount->Count].MoveRow = 0;
								Stack->MenuStack[MenuCount->Count].EditCol = 0;
								MenuCount->v1=8;
								MenuCount->v2=11;
								NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
								break;
							default:
								break;
						}
						Comm_Ram->ButtonVal&=~0x1F;//键使用后清0
					}
					else
					{
						Comm_Ram->ButtonVal&=~0x10;//键使用后清0
						break;
					}
				}
				else//if(Stack->MenuStack[MenuCount->Count].EditCol!=0)
				{
					Select(MenuCount->v2,MenuCount->v1);
					UpDownSelect();
					if((Comm_Ram->ButtonVal&0x10)!=0)
					{//确认
						if(Stack->MenuStack[MenuCount->Count].EditRow==1)
						{
							p16=(u16 *)(ADDR_STRINGBUFF+1*84+4+16*2);
							p16[0]=0x2020;
							p16[1]=0x2020;
							p16[2]=32;//'左右箭头'
							p16[3]=33;
							p8=(u8 *)(ADDR_STRINGBUFF+1*84+4+8*2);
							x=p8_bcd(p8,4);
							if(x>MAX_PN_NUM) bcd_p8(p8,9999,4);
						}
						Stack->MenuStack[MenuCount->Count].EditCol=0;
						Comm_Ram->ButtonVal&=~0x1F;//键使用后清0
					}
					else
					{
						Comm_Ram->ButtonVal&=~0x0F;//键使用后清0
						break;
					}
				}
			}
			
			if((Comm_Ram->ButtonVal&0x20)!=0)
			{//返回
				MenuDel();//返回上级菜单
			}
			Comm_Ram->ButtonVal&=~0x20;//键使用后清0
			break;
		default:
			break;
	}
}



//-------------------------------------------------------------------------------------------------
// Function name:       Menu_7_2_3
// Descriptions:        修改测量点 
// input parameters:    无
// output parameters:   无
// Returned value:      无
//-------------------------------------------------------------------------------------------------
void Menu_7_2_3(void)//修改测量点
{
	u8 *p8;
	u16 *p16;
	u64 x;
//	u32 PnNum = 0;
	u32 EditRow = 0, j = 0;
//	u32 FlashLenAddr = 0, FlashLen = 0;	
//	MeasurePointStruct  MeasurePoint;	
	QCSG_LCD_RAMDATA_S* Pn_Lcd_Data = (QCSG_LCD_RAMDATA_S*)ADDR_LCD_MeterAMRDataBuf;
	
	
	switch(Stack->MenuStack[MenuCount->Count].Task)//菜单任务计数
	{
		case 0://任务0:初始化
			Stack->MenuStack[MenuCount->Count].Task = 1;
			DisplayClr();//清全屏
			MenuCount->v1=0;
			MenuCount->v2=0;
			MenuCount->v3=0;
			DisplayMenu_CSG(Stack->MenuStack[MenuCount->Count].MoveRow,(u8 *)pMenu_7_2_2);//显示菜单
			p8=(u8*)(ADDR_STRINGBUFF+1*84+4+8*2);
			bcd_p8(p8,0,4);		
			MenuCount->v1=8;
			MenuCount->v2=11;
			NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
			break;
		case 2://任务2:滚动屏幕查询测量点信息
			BoxSelectOutofScreenLine();
			Comm_Ram->ButtonVal &= ~0x0F;
			Stack->MenuStack[MenuCount->Count].Task = 2;
			switch(Stack->MenuStack[MenuCount->Count].EditRow+Stack->MenuStack[MenuCount->Count].MoveRow)
			{
				case 1:
					MenuCount->v1=8;
					MenuCount->v2=11;
					NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
					break;
				case 2:
					MenuCount->v1=8;
					MenuCount->v2=11;
					NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
					break;
				case 3:
					MenuCount->v1=8;
					MenuCount->v2=11;
					NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
					break;
				case 4:
					MenuCount->v1=8;
					MenuCount->v2=14;
					NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
					break;
				case 5:
					MenuCount->v1=8;
					MenuCount->v2=14;
					NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
					break;
				case 6:
					MenuCount->v1=8;
					MenuCount->v2=19;
					NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
					break;
				case 7:
					MenuCount->v1=8;
					MenuCount->v2=19;
					NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
					break;
				case 8:
					MenuCount->v1=8;
					MenuCount->v2=15;
					NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
					break;
				case 9:
					MenuCount->v1=8;
					MenuCount->v2=15;
					NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
					break;
				case 10:
					MenuCount->v1=8;
					MenuCount->v2=15;
					NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
					break;
				case 11:
					MenuCount->v1=8;
					MenuCount->v2=15;
					NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
					break;
				case 12:
					MenuCount->v1=8;
					MenuCount->v2=9;
					NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
					break;
				case 13:
					MenuCount->v1=8;
					MenuCount->v2=11;
					NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
					break;
				case 14:
					MenuCount->v1=8;
					MenuCount->v2=11;
					NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);				
					break;
				default:
					break;
			}
			if((Comm_Ram->ButtonVal&0x20)!=0)
			{//返回 
				Stack->MenuStack[MenuCount->Count].Task = 0;
				Stack->MenuStack[MenuCount->Count].MoveRow = 0;
				Stack->MenuStack[MenuCount->Count].EditRow = 1;
				Comm_Ram->ButtonVal&=~0x20;//键使用后清0
			}			
			break;
		case 1://任务1:选择查询的测量点
			for(j=0;j<2;j++)
			{
				if(Stack->MenuStack[MenuCount->Count].EditCol==0)
				{
					BoxSelectOutofScreenLine();
					EditRow = Stack->MenuStack[MenuCount->Count].EditRow;
					switch(Stack->MenuStack[MenuCount->Count].EditRow)
					{
						case 1:
							MenuCount->v1=8;
							MenuCount->v2=11;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 2:
							MenuCount->v1=0;
							MenuNegative(Stack->MenuStack[MenuCount->Count].EditRow);
							break;
						default:
							break;
					}					
					if((Comm_Ram->ButtonVal&0x10)!=0)
					{//确认
						switch(Stack->MenuStack[MenuCount->Count].EditRow)
						{
							case 1:
								Stack->MenuStack[MenuCount->Count].EditCol=MenuCount->v1;
								p16=(u16 *)(ADDR_STRINGBUFF+EditRow*84+4+16*2);
								p16[0]=0x2020;
								p16[1]=0x2020;
								p16[2]=32;//'左右箭头'
								p16[3]=33;
								break;
							case 2:
								p8=(u8*)(ADDR_STRINGBUFF+1*84+4+8*2);
								x=p8_bcd(p8,4);
								//PnNum=(u32)x;
//								FlashLen = x;
//								FlashLenAddr = ADDR_MP_START + (FlashLen * (sizeof(MeasurePointStruct) + sizeof(PowerQualityParaStruct)));
//								FlashLen = sizeof(MeasurePointStruct) ;
//								MR((u32)&MeasurePoint,FlashLenAddr,FlashLen);
//								if((MeasurePoint.State == 0x01) && (BCD_Check(MeasurePoint.Addr, METER_ADDR_SIZE) == NO_ERROR))
//								{
									Pn_Lcd_Data->u16Pn = x;							
//								}
//								else
//								{
//									Pn_Lcd_Data->u16Pn = 0xFFFF;
//								}								
								MenuCreate((u32)Menu_7_2_3_1);//修改测量点     
//								Stack->MenuStack[MenuCount->Count].Task = 0;
//								Stack->MenuStack[MenuCount->Count].EditRow = 1;
//								Stack->MenuStack[MenuCount->Count].MoveRow = 0;
//								Stack->MenuStack[MenuCount->Count].EditCol = 0;
//								MenuCount->v1=8;
//								MenuCount->v2=11;
//								NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
								break;
							default:
								break;
						}
						Comm_Ram->ButtonVal&=~0x1F;//键使用后清0
					}
					else
					{
						Comm_Ram->ButtonVal&=~0x10;//键使用后清0
						break;
					}
				}
				else//if(Stack->MenuStack[MenuCount->Count].EditCol!=0)
				{
					Select(MenuCount->v2,MenuCount->v1);
					UpDownSelect();
					if((Comm_Ram->ButtonVal&0x10)!=0)
					{//确认
						if(Stack->MenuStack[MenuCount->Count].EditRow==1)
						{
							p16=(u16 *)(ADDR_STRINGBUFF+1*84+4+16*2);
							p16[0]=0x2020;
							p16[1]=0x2020;
							p16[2]=32;//'左右箭头'
							p16[3]=33;
							p8=(u8 *)(ADDR_STRINGBUFF+1*84+4+8*2);
							x=p8_bcd(p8,4);
							if(x>MAX_PN_NUM) bcd_p8(p8,9999,4);
						}
						Stack->MenuStack[MenuCount->Count].EditCol=0;
						Comm_Ram->ButtonVal&=~0x1F;//键使用后清0
					}
					else
					{
						Comm_Ram->ButtonVal&=~0x0F;//键使用后清0
						break;
					}
				}
			}
			
			if((Comm_Ram->ButtonVal&0x20)!=0)
			{//返回
				MenuDel();//返回上级菜单
			}
			Comm_Ram->ButtonVal&=~0x20;//键使用后清0
			break;
		default:
			break;
	}
}




#if (Project == 200)|| (Project == 900)
//-------------------------------------------------------------------------------------------------
// Function name:       Menu_7_2_3_1
// Descriptions:        修改测量点
// input parameters:    无
// output parameters:   无
// Returned value:      无
//-------------------------------------------------------------------------------------------------
void Menu_7_2_3_1(void)//集中器修改测量点参数
{
	u8 *p8,*p;
	u16 *p16;
	u32 Pn,Ret;
	u64 x;
	MeasurePointStruct MeasurePoint;
	u32 PnNum = 0, FlashAddr = 0;
	u32 FlashLenAddr = 0,FlashLen = 0;
	u32 i = 0, j = 0,Ln = 0, EditRow = 0;	//菜单从第0行开始	
	MeterFileInfoStruct* MeterFileInfo = (MeterFileInfoStruct*)ADDR_MeterFileInfo;
	QCSG_LCD_RAMDATA_S* Pn_Lcd_Data = (QCSG_LCD_RAMDATA_S*)ADDR_LCD_MeterAMRDataBuf;
	Terminal_Ram_TypeDef* pTerminalRam = Terminal_Ram;
	MenuCount_TypeDef* pMenuCount = MenuCount;
	StrBuff_TypeDef* DispBuf = StrBuff;
	StrBuff_TypeDef* BackDispBuf = StrBuff2;


	FlashAddr = ADDR_MP_START + (Pn_Lcd_Data->u16Pn) * (sizeof(MeasurePointStruct) + sizeof(PowerQualityParaStruct));
	MR((u32)&MeasurePoint,FlashAddr,sizeof(MeasurePointStruct));
	if(MemCompare(MeasurePoint.Addr, EmptyAddr, METER_ADDR_SIZE) == 0)
	{
		DisplayClrRow(1,6);//清屏幕显示的指定行
		DisplayString(4,4,0,"测量点不存在");
	}
	else
	{
		switch(Stack->MenuStack[MenuCount->Count].Task)//菜单任务计数
		{
			case 0://任务0:初始化
				Stack->MenuStack[MenuCount->Count].Task=1;
				DisplayClr();//清全屏
				MenuCount->v1=0;
				MenuCount->v2=0;
				MenuCount->v3=0;
				DisplayMenu_CSG(Stack->MenuStack[MenuCount->Count].MoveRow,(u8 *)pJZQMenu_7_2_1);//显示菜单	
	//			DisplayString(8,8,0,"  单相表");			//电能表类型							
	//			DisplayStringOutoffScreenLine(10,0,0,"总分类型  用户表");				//总分类型											
	//			DisplayStringOutoffScreenLine(11,0,0,"重点户  普通用户");				//重点户属性								
	//			DisplayStringOutoffScreenLine(12,0,0,"拉闸功能不带拉闸");				//拉闸功能
	//			MC(0, (u32)&DispBuf->Row[13], sizeof(StrLnBuff_TypeDef));
	//			DisplayStringOutoffScreenLine(13,0,0,"费率数  04");
	//			DisplayStringOutoffScreenLine(14,0,0,"CT变比  0000");
	//			DisplayStringOutoffScreenLine(15,0,0,"PT变比  0000");
	//			//DisplayStringOutoffScreenLine(15,0,0,"      确认设置\n\r");
	//			pMenuCount->v3 = 0x00001104;

				FlashLenAddr = ADDR_MP_START + (Pn_Lcd_Data->u16Pn * (sizeof(MeasurePointStruct) + sizeof(PowerQualityParaStruct)));
				FlashLen = sizeof(MeasurePointStruct) ;
				MR((u32)&MeasurePoint,FlashLenAddr,FlashLen);
				//第一行测量点号
				p=(u8*)(ADDR_STRINGBUFF+(Ln+1)*84+4+8*2);			
				bcd_p8(p,Pn_Lcd_Data->u16Pn,4);
				//第二行测量点有效性
				switch(MeasurePoint.State)
				{
					case 0:
						DisplayString(Ln+2,8,0,"无效");
						break;
					case 1:
						DisplayString(Ln+2,8,0,"有效");	
						break;
					default:
						DisplayString(Ln+2,8,0,"未知");
						break;
				}
				//第三行波特率
				switch(MeasurePoint.PortBaudRate)
				{
					case 4:
						DisplayString(Ln+3,8,0,"1200");
						break;
					case 8:
						DisplayString(Ln+3,8,0,"2400");	
						break;
					case 0x10:
						DisplayString(Ln+3,8,0,"4800");
						break;
					case 0x20:
						DisplayString(Ln+3,8,0,"9600");	
						break;
					default:
						DisplayString(Ln+3,8,0,"未知");
						break;
				}
				//第四行端口号
				switch(MeasurePoint.PortID)
				{
					case PORT_ID_RS485_1:
						DisplayString(4,8,0,"RS485_1");
						break;									
					case PORT_ID_RS485_2:
						DisplayString(4,8,0,"RS485_2");		
						break;
					case PORT_ID_RS485_3:
						DisplayString(4,8,0,"RS485_3");
						break;
					case PORT_ID_PLC:
						DisplayString(4,8,0,"   载波");
						break;
					case PORT_ID_WIRELESS:
						DisplayString(4,8,0,"   无线");
						break;
					default:
						DisplayString(4,8,0,"   未知");
						break;
				}
				//第五行协议类型
				switch(MeasurePoint.ProtocolType)
				{
					case 0:
						DisplayString(Ln+5,8,0,"  97协议");
						break;
					case 1:
						DisplayString(Ln+5,8,0,"  07协议");	
						break;
					case 0x07:
						DisplayString(Ln+5,8,0,"EDMI协议");	
						break;
					default:
						DisplayString(Ln+5,8,0,"    保留");
						break;
				}
				//第六行测量点地址
				for(i = 0; i < METER_ADDR_SIZE; i++)
				{
					DispBuf->Row[6].Col[8 + i*2 + 1] = 0x2000 + HexToChar[MeasurePoint.Addr[METER_ADDR_SIZE-i-1] & 0x0F];
					DispBuf->Row[6].Col[8 + i*2] = 0x2000 + HexToChar[(MeasurePoint.Addr[METER_ADDR_SIZE-i-1] >> 4) & 0x0F];
				}
				//第七行采集器地址
				for(i = 0; i < METER_ADDR_SIZE; i++)
				{
					DispBuf->Row[7].Col[8 + i*2 + 1] = 0x2000 + HexToChar[MeasurePoint.CollectorAddr[METER_ADDR_SIZE-i-1] & 0x0F];
					DispBuf->Row[7].Col[8 + i*2] = 0x2000 + HexToChar[(MeasurePoint.CollectorAddr[METER_ADDR_SIZE-i-1] >> 4) & 0x0F];
				}

				switch(MeasurePoint.PointMeterType)
				{
					case METER_TYPE_SINGLE:
						DisplayString(8,8,0,"  单相表");
						break;
					case METER_TYPE_MULTI:
						DisplayString(8,8,0,"多功能表");
						break;
					default:
						DisplayString(8,8,0,"  其他表");
						break;
				}
				if(MeasurePoint.TotalType == 0)
				{
					DisplayStringOutoffScreenLine(10,0,0,"总分类型  用户表");		    //总分类型	
				}	
				else if(MeasurePoint.TotalType == 1)
				{
					DisplayStringOutoffScreenLine(10,0,0,"总分类型    总表");		    //总分类型	
				}
				else
				{
					DisplayStringOutoffScreenLine(10,0,0,"总分类型    未知");		    //总分类型
				}
									
