gdgly/NUC97X_JS/STM32F4xx/CSG/MenuCSG/Menu_7_ParametersSetting.c
											MW((u32)&MeasurePoint, FlashAddr, sizeof(MeasurePointStruct));
											DisplayString(8,0,0,"         OK         ");

											MeterFileInfo->CountFlag = METER_FILE_SYNC_TO_RAM_FLAG;
											pTerminalRam->MeterSyncToRam_S_Timer = METER_FILE_SYNC_DELAY_TIME;
										}
									}								
									break;
								default:
									break;
							}						
							Comm_Ram->ButtonVal&=~0x1F;//键使用后清0
						}
						else
						{
							Comm_Ram->ButtonVal&=~0x0F;//键使用后清0
							break;
						}
					}
					else //if(Stack->MenuStack[MenuCount->Count].EditCol!=0)
					{
						Select(MenuCount->v2,MenuCount->v1);
						UpDownSelect();
						if((Comm_Ram->ButtonVal&0x10)!=0)
						{//确认
							EditRow = Stack->MenuStack[MenuCount->Count].EditRow;
							switch(Stack->MenuStack[MenuCount->Count].EditRow+Stack->MenuStack[MenuCount->Count].MoveRow)
							{
								case 1://测量点
									p16=(u16 *)(ADDR_STRINGBUFF+EditRow*84+4+16*2);
									p16[0]=0x2020;
									p16[1]=0x2020;
									p16[2]=32;//'左右箭头'
									p16[3]=33;
									p8=(u8 *)(ADDR_STRINGBUFF+EditRow*84+4+8*2);
									x=p8_bcd(p8,4);
									if(x > MAX_PN_NUM) bcd_p8(p8,9999,4);
									break;
								case 2://有效位
									break;
								case 3://速率			
									break;
								case 4://端口
									break;
								case 5://协议
									break;
								case 6://通信地址
									p8=(u8 *)(ADDR_STRINGBUFF+EditRow*84+4+8*2);
									x=p8_bcd(p8,12);
									if(x>999999999999) bcd_p8(p8,0,12);
									break;
								case 7://采集器地址
									p8=(u8 *)(ADDR_STRINGBUFF+EditRow*84+4+8*2);
									x=p8_bcd(p8,12);
									if(x>999999999999) bcd_p8(p8,0,12);
									break;
								case 8://电能表类型
									break;
								case 9://总分类型
									break;
								case 10://重点户属性
									break;
								case 11://拉闸功能
									break;
								case 12://最大费率数
									p16=(u16 *)(ADDR_STRINGBUFF+EditRow*84+4+16*2);
									p16[0]=0x2020;
									p16[1]=0x2020;
									p16[2]=32;//'左右箭头'
									p16[3]=33;
									p8=(u8 *)(ADDR_STRINGBUFF+EditRow*84+4+8*2);
									x=p8_bcd(p8,2);
									if(x > 16) bcd_p8(p8,0,2);
									break;
								case 13://CT变比
									p16=(u16 *)(ADDR_STRINGBUFF+EditRow*84+4+16*2);
									p16[0]=0x2020;
									p16[1]=0x2020;
									p16[2]=32;//'左右箭头'
									p16[3]=33;
								case 14://PT变比
									p16=(u16 *)(ADDR_STRINGBUFF+EditRow*84+4+16*2);
									p16[0]=0x2020;
									p16[1]=0x2020;
									p16[2]=32;//'左右箭头'
									p16[3]=33;
									break;
							}
							Stack->MenuStack[MenuCount->Count].EditCol=0;
							Comm_Ram->ButtonVal&=~0x1F;//键使用后清0
						}
						else
						{
							Comm_Ram->ButtonVal&=~0x0F;//键使用后清0
							break;
						}
					}
				}
				if((Comm_Ram->ButtonVal&0x20)!=0)
				{//返回
					MenuDel();//返回上级菜单
				}
				Comm_Ram->ButtonVal&=~0x20;//键使用后清0
				break;
			default:
				break;
		}
	}
	if((Comm_Ram->ButtonVal&0x20)!=0)
	{//返回
		MenuDel();//返回上级菜单
	}
	Comm_Ram->ButtonVal&=~0x20;//键使用后清0
}
#endif



//-------------------------------------------------------------------------------------------------
// Function name:       Menu_7_2_4
// Descriptions:        删除测量点
// input parameters:    无
// output parameters:   无
// Returned value:      无
//-------------------------------------------------------------------------------------------------
void Menu_7_2_4(void)//删除测量点
{
	u8 *p1,*p2;
	u16 *p16;
	u32 j,Ln;	
	u32 PnNum1,PnNum2;
	u64 x,k;	
	Ln=0;//菜单从第0行开始


	switch(Stack->MenuStack[MenuCount->Count].Task)//菜单任务计数
	{
		case 0://任务0:初始化
			Stack->MenuStack[MenuCount->Count].Task=1;
			DisplayClr();//清全屏
			MenuCount->v1=0;
			MenuCount->v2=0;
			DisplayMenu(Stack->MenuStack[MenuCount->Count].MoveRow,(u8 *)pMenu_7_2_3);//显示菜单
			
		  //默认显示测量点号为0
			p1=(u8*)(ADDR_STRINGBUFF+(Ln+1)*84+4+9*2);
			p2=(u8*)(ADDR_STRINGBUFF+(Ln+2)*84+4+9*2);
			bcd_p8(p1,0,4);	
			bcd_p8(p2,0,4);		
			MenuCount->v1=9;
			MenuCount->v2=12;
			NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
			break;		
		case 1://任务1:选择
			for(j=0;j<2;j++)
			{
				if(Stack->MenuStack[MenuCount->Count].EditCol==0)
				{
					BoxSelect();
					if(Stack->MenuStack[MenuCount->Count].EditRow!=3)
					{
						DisplayString(Ln+3,8,0,"确认");
					}
					switch(Stack->MenuStack[MenuCount->Count].EditRow)
					{
						case 1:
							MenuCount->v1=9;
							MenuCount->v2=12;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 2:
							MenuCount->v1=9;
							MenuCount->v2=12;
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 3:
							MenuCount->v1=0;
							MenuNegative(Stack->MenuStack[MenuCount->Count].EditRow);
							break;
						default:
							break;
					}					
					if((Comm_Ram->ButtonVal&0x10)!=0)
					{//确认
						switch(Stack->MenuStack[MenuCount->Count].EditRow)
						{
							case 1:
								Stack->MenuStack[MenuCount->Count].EditCol=MenuCount->v1;
								DisplayString(Ln+Stack->MenuStack[MenuCount->Count].EditRow,16,0,"输入");
								break;
							case 2:
								Stack->MenuStack[MenuCount->Count].EditCol=MenuCount->v1;
								DisplayString(Ln+Stack->MenuStack[MenuCount->Count].EditRow,16,0,"输入");
								break;
							case 3:
								//保存设置的数据
								p1=(u8*)(ADDR_STRINGBUFF+(Ln+1)*84+4+9*2);
								x=p8_bcd(p1,4);
								PnNum1=(u32)x;
								p2=(u8*)(ADDR_STRINGBUFF+(Ln+2)*84+4+9*2);
								k=p8_bcd(p2,4);
								PnNum2=(u32)k;
								MeasurePointClr(PnNum1,PnNum2);							
								
								DisplayClrRow_4(Ln+3);//清屏幕显示的指定行(4个控制字不清)
								DisplayString(Ln+3,9,0,"OK");
							
								break;
							default:
								break;
						}
						Comm_Ram->ButtonVal&=~0x1F;//键使用后清0
					}
					else
					{
						Comm_Ram->ButtonVal&=~0x0F;//键使用后清0
						break;
					}
				}
				else//if(Stack->MenuStack[MenuCount->Count].EditCol!=0)
				{
					Select(MenuCount->v2,MenuCount->v1);
					UpDownSelect();
					if((Comm_Ram->ButtonVal&0x10)!=0)
					{//确认
						switch(Stack->MenuStack[MenuCount->Count].EditRow)
						{
							case 1:
								p16=(u16 *)(ADDR_STRINGBUFF+(Ln+1)*84+4+16*2);
								p16[0]=0x2020;
								p16[1]=0x2020;
								p16[2]=32;//'左右箭头'
								p16[3]=33;		
								p1=(u8 *)(ADDR_STRINGBUFF+(Ln+1)*84+4+9*2);
								x=p8_bcd(p1,4);
								if(x>MAX_PN_NUM)
								{
									bcd_p8(p1,9999,4);
								}
								break;
							case 2:
								p16=(u16 *)(ADDR_STRINGBUFF+(Ln+2)*84+4+16*2);
								p16[0]=0x2020;
								p16[1]=0x2020;
								p16[2]=32;//'左右箭头'
								p16[3]=33;		
								p2=(u8 *)(ADDR_STRINGBUFF+(Ln+2)*84+4+9*2);
								k=p8_bcd(p2,4);
								if(k>MAX_PN_NUM)
								{
									bcd_p8(p2,9999,4);
								}
								break;
							default:
								break;
						}
						Stack->MenuStack[MenuCount->Count].EditCol=0;
						Comm_Ram->ButtonVal&=~0x1F;//键使用后清0
					}
					else
					{
						Comm_Ram->ButtonVal&=~0x0F;//键使用后清0
						break;
					}
				}
			}
			
			if((Comm_Ram->ButtonVal&0x20)!=0)
			{//返回
				MenuDel();//返回上级菜单
			}
			Comm_Ram->ButtonVal&=~0x20;//键使用后清0
			break;
		default:
			break;
	}
}


//#if ((Project/100)==2)
//-------------------------------------------------------------------------------------------------
// Function name:       DisplayMPInformation
// Descriptions:        
// input parameters:    无
// output parameters:   无
// Returned value:      无
//-------------------------------------------------------------------------------------------------
void DisplayMPInformation(u32 PnNum)
{
	u8 *p8;
	u64 x = 0;
	u32 FlashAddr = 0, i = 0;		
	StrBuff_TypeDef* DispBuf = StrBuff;
	MeasurePointStruct MeasurePoint;
	
	
	FlashAddr = ADDR_MP_START + PnNum * (sizeof(MeasurePointStruct) + sizeof(PowerQualityParaStruct));
	MR((u32)&MeasurePoint,FlashAddr,sizeof(MeasurePointStruct));
	if(MemCompare(MeasurePoint.Addr, EmptyAddr, METER_ADDR_SIZE) == 0)
	{
		DisplayClrRow(1,8);//清屏幕显示的指定行
		DisplayString(4,4,0,"测量点不存在");
	}
	else
	{
		DisplayMenu_CSG(Stack->MenuStack[MenuCount->Count].MoveRow,(u8 *)pJZQMenu_7_2_4);//显示菜单
		p8=(u8*)(ADDR_STRINGBUFF+1*84+4+8*2);
		bcd_p8(p8,PnNum,4);							// 测量点号
		MR(ADDR_DATABUFF,(u32)&MeasurePoint.State,1);
		if(MeasurePoint.State == 0x01)
		{
			DisplayString(2,8,0,"有效");
		}
		else
		{
			DisplayString(2,8,0,"无效");
		}
		switch(MeasurePoint.PortBaudRate)
		{
			case 4:
				DisplayString(3,8,0,"1200");				
				break;
			case 8:
				DisplayString(3,8,0,"2400");				
				break;
			case 16:
				DisplayString(3,8,0,"4800");				
				break;
			case 32:
				DisplayString(3,8,0,"9600");				
				break;
			default:
				DisplayString(3,8,0,"未知");
				break;	
		}									
		switch(MeasurePoint.PortID)
		{
			case PORT_ID_RS485_1:
				DisplayString(4,8,0,"RS485_1");
				break;									
			case PORT_ID_RS485_2:
				DisplayString(4,8,0,"RS485_2");		
				break;
			case PORT_ID_RS485_3:
				DisplayString(4,8,0,"RS485_3");
				break;
			case PORT_ID_PLC:
				DisplayString(4,8,0,"   载波");
				break;
			case PORT_ID_WIRELESS:
				DisplayString(4,8,0,"   无线");
				break;
			default:
				DisplayString(4,8,0,"   未知");
				break;
		}
		switch(MeasurePoint.ProtocolType)
		{
			case 0:
				DisplayString(5,8,0,"  97协议");
				break;
			case 1:
				DisplayString(5,8,0,"  07协议");
				break;
			case 0x07:
				DisplayString(5,8,0,"EDMI协议");
				break;
			default:
				DisplayString(5,8,0,"    保留");
				break;
		}

		for(i = 0; i < METER_ADDR_SIZE; i++)
		{
			DispBuf->Row[6].Col[8 + i*2 + 1] = 0x2000 + HexToChar[MeasurePoint.Addr[METER_ADDR_SIZE-i-1] & 0x0F];
			DispBuf->Row[6].Col[8 + i*2] = 0x2000 + HexToChar[(MeasurePoint.Addr[METER_ADDR_SIZE-i-1] >> 4) & 0x0F];
		}

		for(i = 0; i < METER_ADDR_SIZE; i++)
		{
			DispBuf->Row[7].Col[8 + i*2 + 1] = 0x2000 + HexToChar[MeasurePoint.CollectorAddr[METER_ADDR_SIZE-i-1] & 0x0F];
			DispBuf->Row[7].Col[8 + i*2] = 0x2000 + HexToChar[(MeasurePoint.CollectorAddr[METER_ADDR_SIZE-i-1] >> 4) & 0x0F];
		}
			
		switch(MeasurePoint.PointMeterType)
		{
			case METER_TYPE_SINGLE:
				DisplayString(8,8,0,"  单相表");
				break;
			case METER_TYPE_MULTI:
				DisplayString(8,8,0,"多功能表");
				break;
			default:
				DisplayString(8,8,0,"  其他表");
				break;
		}
		if(MeasurePoint.TotalType == 0)
		{
			DisplayStringOutoffScreenLine(10,0,0,"总分类型  用户表");		//总分类型	
		}	
		else if(MeasurePoint.TotalType == 1)
		{
			DisplayStringOutoffScreenLine(10,0,0,"总分类型    总表");		//总分类型	
		}
		else
		{
			DisplayStringOutoffScreenLine(10,0,0,"总分类型    未知");		//总分类型
		}
							
