gdgly/NUC97X_JS/STM32F4xx/CSG/MenuCSG/Menu_7_ParametersSetting.c
		if(MeasurePoint.PriorityType == 0)
		{
			DisplayStringOutoffScreenLine(11,0,0,"重点户  普通用户");		//重点户属性		
		}	
		else if(MeasurePoint.PriorityType == 1)
		{
			DisplayStringOutoffScreenLine(11,0,0,"重点户  重点用户");		//重点户属性
		}
		else
		{
			DisplayStringOutoffScreenLine(11,0,0,"重点户      未知");		//重点户属性
		}								
		if(MeasurePoint.SwitchOff == 0)
		{
			DisplayStringOutoffScreenLine(12,0,0,"拉闸功能不带拉闸");		//拉闸功能		
		}	
		else if(MeasurePoint.SwitchOff == 1)
		{
			DisplayStringOutoffScreenLine(12,0,0,"拉闸功能  带拉闸");		//拉闸功能
		}
		else
		{
			DisplayStringOutoffScreenLine(12,0,0,"拉闸功能    未知");		//拉闸功能
		}

		MC(0, (u32)&DispBuf->Row[13], sizeof(StrLnBuff_TypeDef));
		DisplayStringOutoffScreenLine(13,0,0,"费率数  04");
		DisplayStringOutoffScreenLine(14,0,0,"CT变比  0000");
		DisplayStringOutoffScreenLine(15,0,0,"PT变比  0000");		
		
		x = bcd_hex(MeasurePoint.MaxRateNum);
		p8=(u8*)(ADDR_STRINGBUFF+13*84+4+8*2);
		bcd_p8(p8, x, 2);

		x = bcd_hex(MeasurePoint.CT);
		p8=(u8*)(ADDR_STRINGBUFF+14*84+4+8*2);
		bcd_p8(p8, x, 4);		

		x = bcd_hex(MeasurePoint.PT);
		p8=(u8*)(ADDR_STRINGBUFF+15*84+4+8*2);
		bcd_p8(p8, x, 4);
	}				
}
//#endif




//-------------------------------------------------------------------------------------------------
// Function name:       MeasurePointClr
// Descriptions:        
// input parameters:    无
// output parameters:   无
// Returned value:      无
//-------------------------------------------------------------------------------------------------
void MeasurePointClr(u32 PnNum1,u32 PnNum2)
{
	u32 i=0;
	u32 FlashAddr = 0;
	MeasurePointStruct MeasurePoint;
	MeterFileInfoStruct* MeterFileInfo = (MeterFileInfoStruct*)ADDR_MeterFileInfo;
	Terminal_Ram_TypeDef* pTerminalRam = Terminal_Ram;	
	
	if(PnNum1 > MAX_PN_NUM) 
	{
		PnNum1 = MAX_PN_NUM;
	}
	if(PnNum2 > MAX_PN_NUM) 
	{
		PnNum2 = MAX_PN_NUM;
	}		
	if(PnNum1 > PnNum2)
	{
		return;
	}
	
	i=PnNum1;
	for(i=PnNum1;i<=PnNum2;i++)
	{
		FlashAddr = ADDR_MP_START + i * (sizeof(MeasurePointStruct) + sizeof(PowerQualityParaStruct));
		MR((u32)&MeasurePoint,FlashAddr,sizeof(MeasurePointStruct));
		MC(0xFF,FlashAddr,sizeof(MeasurePointStruct));                   //测量点的信息全部清为0xFF
		//MR((u32)&MeasurePoint,FlashAddr,sizeof(MeasurePointStruct));   //帮助调试时使用
		//同步测量点
		MeterFileInfo->CountFlag = METER_FILE_SYNC_TO_RAM_FLAG;
		pTerminalRam->MeterSyncToRam_S_Timer = METER_FILE_SYNC_DELAY_TIME;	
	}
	
	if((Comm_Ram->ButtonVal&0x20)!=0)
	{//返回 
		MenuDel();//返回上级菜单
	}
	Comm_Ram->ButtonVal&=~0x20;//键使用后清0
}
//-------------------------------------------------------------------------------------------------
// Function name:       Menu_7_3
// Descriptions:        限值参数查询
// input parameters:    无
// output parameters:   无
// Returned value:      无
//-------------------------------------------------------------------------------------------------
void Menu_7_3(void)
{	
	switch(Stack->MenuStack[MenuCount->Count].Task)//菜单任务计数
	{
		case 0://任务0:初始化
			Stack->MenuStack[MenuCount->Count].Task=1;
			#if ((Project/100)==3) || ((Project/100)==9)//负控终端
				DisplayMenu(Stack->MenuStack[MenuCount->Count].MoveRow,(u8 *)pMenu_7_3);//显示菜单
			#endif
			#if ((Project/100)==2)//集中器
				DisplayMenu(Stack->MenuStack[MenuCount->Count].MoveRow,(u8 *)pJZQMenu_7_3);//显示菜单
			#endif
			Arrowhead();
			MenuNegative(Stack->MenuStack[MenuCount->Count].EditRow);//反显菜单行
			break;
		case 1://任务1:选择
			MenuSelect();//菜单选择
			if((Comm_Ram->ButtonVal&0x10)!=0)
			{//确认
				switch(Stack->MenuStack[MenuCount->Count].EditRow+Stack->MenuStack[MenuCount->Count].MoveRow)
				{
					case 1:
						MenuCreate((u32)Menu_7_3_1);//月通信流量越限值
						break;
					case 2:
						MenuCreate((u32)Menu_7_3_2);//电能表时钟超差阈值
						break;
					case 3:
						MenuCreate((u32)Menu_7_3_3);//电能表飞走阈值
						break;
					default:
						break;
				}              
			}
			if((Comm_Ram->ButtonVal&0x20)!=0)
			{//返回
				MenuDel();//返回上级菜单
			}
			Comm_Ram->ButtonVal&=~0x3F;//键使用后清0
			break;
		default:
			break;
	}
}

//-------------------------------------------------------------------------------------------------
// Function name:       Menu_7_3_1
// Descriptions:        月通信流量越限值
// input parameters:    无
// output parameters:   无
// Returned value:      无
//-------------------------------------------------------------------------------------------------
void Menu_7_3_1(void)//月通信流量越限值
{
	u32 *p32,*q32;
	u32 Ln=0;          //菜单从第0行开始
	ThresholdParaStruct ThresholdPara;

	
	DisplayClr();//清全屏
	MenuCount->v1=0;
	MenuCount->v2=0;
	DisplayMenu(Stack->MenuStack[MenuCount->Count].MoveRow,(u8 *)pMenu_7_3_1);//显示菜单
	
	//显示内存中数据	
	//月通信流量越限值		
	MR((u32)&ThresholdPara,ADDR_ThresholdPara,sizeof(ThresholdParaStruct));	
	p32=(u32*)ADDR_DATABUFF;				
	MR(ADDR_DATABUFF,(u32)&ThresholdPara.E000018C,3);			
	q32=(u32*)(ADDR_STRINGBUFF+(Ln+1)*84+4+11*2);
	DisplayData(p32[0]&0x00FFFFFF,6,0,(u16*)q32);
	MenuCount->v1=11;
	MenuCount->v2=19;
	NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);

	if((Comm_Ram->ButtonVal&0x20)!=0)
	{//返回
		MenuDel();//返回上级菜单
	}
	Comm_Ram->ButtonVal&=~0x20;//键使用后清0
}

//-------------------------------------------------------------------------------------------------
// Function name:       Menu_7_3_2
// Descriptions:        电能表时钟超差阈值
// input parameters:    无
// output parameters:   无
// Returned value:      无
//-------------------------------------------------------------------------------------------------
void Menu_7_3_2(void)//电能表时钟超差阈值
{	
	u8 *p,*p8;
	u32 Ln=0;         //菜单从第0行开始
	ThresholdParaStruct ThresholdPara;

	
	DisplayClr();//清全屏
	MenuCount->v1=0;
	MenuCount->v2=0;
	DisplayMenu(Stack->MenuStack[MenuCount->Count].MoveRow,(u8 *)pMenu_7_3_2);//显示菜单
	
	//显示内存中数据	
	//电能表时钟超差阈值			
	MR((u32)&ThresholdPara,ADDR_ThresholdPara,sizeof(ThresholdParaStruct));
	p8=(u8*)ADDR_DATABUFF;
	MR((u32)p8,(u32)&ThresholdPara.E0000188,1);
	p=(u8*)(ADDR_STRINGBUFF+(Ln+1)*84+4+14*2);
	DisplayData(p8[0],2,0,(u16*)p);
	MenuCount->v1=14;
	MenuCount->v2=19;
	NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
	
	if((Comm_Ram->ButtonVal&0x20)!=0)
	{//返回
		MenuDel();//返回上级菜单
	}
	Comm_Ram->ButtonVal&=~0x20;//键使用后清0
}

#if ((Project/100)==3) || ((Project/100)==9) //负控终端
//-------------------------------------------------------------------------------------------------
// Function name:       Menu_7_3_3
// Descriptions:        电能表飞走阈值
// input parameters:    无
// output parameters:   无
// Returned value:      无
//-------------------------------------------------------------------------------------------------
void Menu_7_3_3(void)//电能表飞走阈值
{	
	u8 *p,*p8;
	u32 Ln=0;//菜单从第0行开始
	ThresholdParaStruct ThresholdPara;
	
	
